def @main(%models.29.conv22.weight: Tensor[(1024, 1280, 3, 3), float32], %call_97: Tensor[(1, 1280, 13, 13), float32] {
  nn.conv2d(%97, %models.29.conv22.weight, padding=[1, 1, 1, 1], channels=1024, kernel_size=[3, 3]) /* ty=Tensor[(1, 1024, 13, 13), float32] */;
}