def @main(%call_13: Tensor[(1, 128, 104, 104), float32], %models.5.conv4.weight: Tensor[(64, 128, 1, 1), float32] {
  nn.conv2d(%13, %models.5.conv4.weight, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 104, 104), float32] */;
}