def @main(%models.8.conv6.weight: Tensor[(256, 128, 3, 3), float32], %call_22: Tensor[(1, 128, 52, 52), float32] {
  nn.conv2d(%22, %models.8.conv6.weight, padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]) /* ty=Tensor[(1, 256, 52, 52), float32] */;
}