def @main(%models.9.conv7.weight: Tensor[(128, 256, 1, 1), float32]), %call_26: Tensor[(1, 256, 52, 52), float32] {
  nn.conv2d(%26, %models.9.conv7.weight, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(1, 128, 52, 52), float32] */;
}