def @main(%models.15.conv12.weight: Tensor[(256, 512, 1, 1), float32], %call_47: Tensor[(1, 512, 26, 26), float32] {
  nn.conv2d(%47, %models.15.conv12.weight, padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]) /* ty=Tensor[(1, 256, 26, 26), float32] */;
}