def @main(%models.12.conv9.weight: Tensor[(512, 256, 3, 3), float32], %call_35: Tensor[(1, 256, 26, 26), float32] {
  nn.conv2d(%35, %models.12.conv9.weight, padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]) /* ty=Tensor[(1, 512, 26, 26), float32] */;
}