def @main(%models.29.bn22.running_var: Tensor[(1024), float32], %models.30.conv23.weight: Tensor[(425, 1024, 1, 1), float32], %models.29.bn22.bias: Tensor[(1024), float32], %models.29.bn22.weight: Tensor[(1024), float32], %models.29.bn22.running_mean: Tensor[(1024), float32], %call_98: Tensor[(1, 1024, 13, 13), float32], %models.30.conv23.bias: Tensor[(425), float32] {
  %99 = nn.batch_norm(%98, %models.29.bn22.weight, %models.29.bn22.bias, %models.29.bn22.running_mean, %models.29.bn22.running_var) /* ty=(Tensor[(1, 1024, 13, 13), float32], Tensor[(1024), float32], Tensor[(1024), float32]) */;
  %100 = %99.0;
  %101 = nn.leaky_relu(%100, alpha=0.1f) /* ty=Tensor[(1, 1024, 13, 13), float32] */;
  %102 = nn.conv2d(%101, %models.30.conv23.weight, padding=[0, 0, 0, 0], channels=425, kernel_size=[1, 1]) /* ty=Tensor[(1, 425, 13, 13), float32] */;
  nn.bias_add(%102, %models.30.conv23.bias) /* ty=Tensor[(1, 425, 13, 13), float32] */
}