def @main(%call_4: Tensor[(1, 32, 208, 208), float32], %models.2.conv2.weight: Tensor[(64, 32, 3, 3), float32] {
  nn.conv2d(%4, %models.2.conv2.weight, padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(1, 64, 208, 208), float32] */;
}