def @main(%models.14.conv11.weight: Tensor[(512, 256, 3, 3), float32], %call_43: Tensor[(1, 256, 26, 26), float32] {
  nn.conv2d(%43, %models.14.conv11.weight, padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]) /* ty=Tensor[(1, 512, 26, 26), float32] */;
}