def @main(%models.0.bn1.running_var: Tensor[(32), float32], %models.0.conv1.weight: Tensor[(32, 3, 3, 3), float32], %models.0.bn1.running_mean: Tensor[(32), float32], %models.0.bn1.bias: Tensor[(32), float32], %models.0.bn1.weight: Tensor[(32), float32], %input.1: Tensor[(1, 3, 416, 416), float32] {
  %0 = nn.conv2d(%input.1, %models.0.conv1.weight, padding=[1, 1, 1, 1], channels=32, kernel_size=[3, 3]) /* ty=Tensor[(1, 32, 416, 416), float32] */;
  nn.batch_norm(%0, %models.0.bn1.weight, %models.0.bn1.bias, %models.0.bn1.running_mean, %models.0.bn1.running_var) /* ty=(Tensor[(1, 32, 416, 416), float32], Tensor[(32), float32], Tensor[(32), float32]) */;
}