def @main(%models.13.conv10.weight: Tensor[(256, 512, 1, 1), float32], %call_39: Tensor[(1, 512, 26, 26), float32] {
  nn.conv2d(%39, %models.13.conv10.weight, padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]) /* ty=Tensor[(1, 256, 26, 26), float32] */;
}