def @main(%call_9: Tensor[(1, 64, 104, 104), float32], %models.4.conv3.weight: Tensor[(128, 64, 3, 3), float32] {
  nn.conv2d(%9, %models.4.conv3.weight, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(1, 128, 104, 104), float32] */;
}