def @main(%models.10.conv8.weight: Tensor[(256, 128, 3, 3), float32], %call_30: Tensor[(1, 128, 52, 52), float32] {
  nn.conv2d(%30, %models.10.conv8.weight, padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]) /* ty=Tensor[(1, 256, 52, 52), float32] */;
}