def @main(%data_0: Tensor[(1, 3, 224, 224), float32], %conv1/7x7_s2_w_0: Tensor[(64, 3, 7, 7), float32], %conv1/7x7_s2_b_0: Tensor[(64), float32], %conv2/3x3_reduce_w_0: Tensor[(64, 64, 1, 1), float32], %conv2/3x3_reduce_b_0: Tensor[(64), float32], %conv2/3x3_w_0: Tensor[(192, 64, 3, 3), float32], %conv2/3x3_b_0: Tensor[(192), float32], %inception_3a/1x1_w_0: Tensor[(64, 192, 1, 1), float32], %inception_3a/1x1_b_0: Tensor[(64), float32], %inception_3a/3x3_reduce_w_0: Tensor[(96, 192, 1, 1), float32], %inception_3a/3x3_reduce_b_0: Tensor[(96), float32], %inception_3a/3x3_w_0: Tensor[(128, 96, 3, 3), float32], %inception_3a/3x3_b_0: Tensor[(128), float32], %inception_3a/5x5_reduce_w_0: Tensor[(16, 192, 1, 1), float32], %inception_3a/5x5_reduce_b_0: Tensor[(16), float32], %inception_3a/5x5_w_0: Tensor[(32, 16, 5, 5), float32], %inception_3a/5x5_b_0: Tensor[(32), float32], %inception_3a/pool_proj_w_0: Tensor[(32, 192, 1, 1), float32], %inception_3a/pool_proj_b_0: Tensor[(32), float32], %inception_3b/1x1_w_0: Tensor[(128, 256, 1, 1), float32], %inception_3b/1x1_b_0: Tensor[(128), float32], %inception_3b/3x3_reduce_w_0: Tensor[(128, 256, 1, 1), float32], %inception_3b/3x3_reduce_b_0: Tensor[(128), float32], %inception_3b/3x3_w_0: Tensor[(192, 128, 3, 3), float32], %inception_3b/3x3_b_0: Tensor[(192), float32], %inception_3b/5x5_reduce_w_0: Tensor[(32, 256, 1, 1), float32], %inception_3b/5x5_reduce_b_0: Tensor[(32), float32], %inception_3b/5x5_w_0: Tensor[(96, 32, 5, 5), float32], %inception_3b/5x5_b_0: Tensor[(96), float32], %inception_3b/pool_proj_w_0: Tensor[(64, 256, 1, 1), float32], %inception_3b/pool_proj_b_0: Tensor[(64), float32], %inception_4a/1x1_w_0: Tensor[(192, 480, 1, 1), float32], %inception_4a/1x1_b_0: Tensor[(192), float32], %inception_4a/3x3_reduce_w_0: Tensor[(96, 480, 1, 1), float32], %inception_4a/3x3_reduce_b_0: Tensor[(96), float32], %inception_4a/3x3_w_0: Tensor[(208, 96, 3, 3), float32], %inception_4a/3x3_b_0: Tensor[(208), float32], %inception_4a/5x5_reduce_w_0: Tensor[(16, 480, 1, 1), float32], %inception_4a/5x5_reduce_b_0: Tensor[(16), float32], %inception_4a/5x5_w_0: Tensor[(48, 16, 5, 5), float32], %inception_4a/5x5_b_0: Tensor[(48), float32], %inception_4a/pool_proj_w_0: Tensor[(64, 480, 1, 1), float32], %inception_4a/pool_proj_b_0: Tensor[(64), float32], %inception_4b/1x1_w_0: Tensor[(160, 512, 1, 1), float32], %inception_4b/1x1_b_0: Tensor[(160), float32], %inception_4b/3x3_reduce_w_0: Tensor[(112, 512, 1, 1), float32], %inception_4b/3x3_reduce_b_0: Tensor[(112), float32], %inception_4b/3x3_w_0: Tensor[(224, 112, 3, 3), float32], %inception_4b/3x3_b_0: Tensor[(224), float32], %inception_4b/5x5_reduce_w_0: Tensor[(24, 512, 1, 1), float32], %inception_4b/5x5_reduce_b_0: Tensor[(24), float32], %inception_4b/5x5_w_0: Tensor[(64, 24, 5, 5), float32], %inception_4b/5x5_b_0: Tensor[(64), float32], %inception_4b/pool_proj_w_0: Tensor[(64, 512, 1, 1), float32], %inception_4b/pool_proj_b_0: Tensor[(64), float32], %inception_4c/1x1_w_0: Tensor[(128, 512, 1, 1), float32], %inception_4c/1x1_b_0: Tensor[(128), float32], %inception_4c/3x3_reduce_w_0: Tensor[(128, 512, 1, 1), float32], %inception_4c/3x3_reduce_b_0: Tensor[(128), float32], %inception_4c/3x3_w_0: Tensor[(256, 128, 3, 3), float32], %inception_4c/3x3_b_0: Tensor[(256), float32], %inception_4c/5x5_reduce_w_0: Tensor[(24, 512, 1, 1), float32], %inception_4c/5x5_reduce_b_0: Tensor[(24), float32], %inception_4c/5x5_w_0: Tensor[(64, 24, 5, 5), float32], %inception_4c/5x5_b_0: Tensor[(64), float32], %inception_4c/pool_proj_w_0: Tensor[(64, 512, 1, 1), float32], %inception_4c/pool_proj_b_0: Tensor[(64), float32], %inception_4d/1x1_w_0: Tensor[(112, 512, 1, 1), float32], %inception_4d/1x1_b_0: Tensor[(112), float32], %inception_4d/3x3_reduce_w_0: Tensor[(144, 512, 1, 1), float32], %inception_4d/3x3_reduce_b_0: Tensor[(144), float32], %inception_4d/3x3_w_0: Tensor[(288, 144, 3, 3), float32], %inception_4d/3x3_b_0: Tensor[(288), float32], %inception_4d/5x5_reduce_w_0: Tensor[(32, 512, 1, 1), float32], %inception_4d/5x5_reduce_b_0: Tensor[(32), float32], %inception_4d/5x5_w_0: Tensor[(64, 32, 5, 5), float32], %inception_4d/5x5_b_0: Tensor[(64), float32], %inception_4d/pool_proj_w_0: Tensor[(64, 512, 1, 1), float32], %inception_4d/pool_proj_b_0: Tensor[(64), float32], %inception_4e/1x1_w_0: Tensor[(256, 528, 1, 1), float32], %inception_4e/1x1_b_0: Tensor[(256), float32], %inception_4e/3x3_reduce_w_0: Tensor[(160, 528, 1, 1), float32], %inception_4e/3x3_reduce_b_0: Tensor[(160), float32], %inception_4e/3x3_w_0: Tensor[(320, 160, 3, 3), float32], %inception_4e/3x3_b_0: Tensor[(320), float32], %inception_4e/5x5_reduce_w_0: Tensor[(32, 528, 1, 1), float32], %inception_4e/5x5_reduce_b_0: Tensor[(32), float32], %inception_4e/5x5_w_0: Tensor[(128, 32, 5, 5), float32], %inception_4e/5x5_b_0: Tensor[(128), float32], %inception_4e/pool_proj_w_0: Tensor[(128, 528, 1, 1), float32], %inception_4e/pool_proj_b_0: Tensor[(128), float32], %inception_5a/1x1_w_0: Tensor[(256, 832, 1, 1), float32], %inception_5a/1x1_b_0: Tensor[(256), float32], %inception_5a/3x3_reduce_w_0: Tensor[(160, 832, 1, 1), float32], %inception_5a/3x3_reduce_b_0: Tensor[(160), float32], %inception_5a/3x3_w_0: Tensor[(320, 160, 3, 3), float32], %inception_5a/3x3_b_0: Tensor[(320), float32], %inception_5a/5x5_reduce_w_0: Tensor[(32, 832, 1, 1), float32], %inception_5a/5x5_reduce_b_0: Tensor[(32), float32], %inception_5a/5x5_w_0: Tensor[(128, 32, 5, 5), float32], %inception_5a/5x5_b_0: Tensor[(128), float32], %inception_5a/pool_proj_w_0: Tensor[(128, 832, 1, 1), float32], %inception_5a/pool_proj_b_0: Tensor[(128), float32], %inception_5b/1x1_w_0: Tensor[(384, 832, 1, 1), float32], %inception_5b/1x1_b_0: Tensor[(384), float32], %inception_5b/3x3_reduce_w_0: Tensor[(192, 832, 1, 1), float32], %inception_5b/3x3_reduce_b_0: Tensor[(192), float32], %inception_5b/3x3_w_0: Tensor[(384, 192, 3, 3), float32], %inception_5b/3x3_b_0: Tensor[(384), float32], %inception_5b/5x5_reduce_w_0: Tensor[(48, 832, 1, 1), float32], %inception_5b/5x5_reduce_b_0: Tensor[(48), float32], %inception_5b/5x5_w_0: Tensor[(128, 48, 5, 5), float32], %inception_5b/5x5_b_0: Tensor[(128), float32], %inception_5b/pool_proj_w_0: Tensor[(128, 832, 1, 1), float32], %inception_5b/pool_proj_b_0: Tensor[(128), float32], %loss3/classifier_w_0: Tensor[(1000, 1024), float32], %loss3/classifier_b_0: Tensor[(1000), float32], %OC2_DUMMY_1: Tensor[(2), int64]) {
  %0 = nn.conv2d(%data_0, %conv1/7x7_s2_w_0, strides=[2, 2], padding=[3, 3, 3, 3], channels=64, kernel_size=[7, 7]);
  %1 = nn.bias_add(%0, %conv1/7x7_s2_b_0);
  %2 = nn.relu(%1);
  %3 = nn.max_pool2d(%2, pool_size=[3, 3], strides=[2, 2], padding=[0, 0, 2, 2]);
  %4 = nn.lrn(%3, bias=1f);
  %5 = nn.conv2d(%4, %conv2/3x3_reduce_w_0, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]);
  %6 = nn.bias_add(%5, %conv2/3x3_reduce_b_0);
  %7 = nn.relu(%6);
  %8 = nn.conv2d(%7, %conv2/3x3_w_0, padding=[1, 1, 1, 1], channels=192, kernel_size=[3, 3]);
  %9 = nn.bias_add(%8, %conv2/3x3_b_0);
  %10 = nn.relu(%9);
  %11 = nn.lrn(%10, bias=1f);
  %12 = nn.max_pool2d(%11, pool_size=[3, 3], strides=[2, 2], padding=[0, 0, 2, 2]);
  %13 = nn.conv2d(%12, %inception_3a/1x1_w_0, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]);
  %14 = nn.bias_add(%13, %inception_3a/1x1_b_0);
  %15 = nn.conv2d(%12, %inception_3a/3x3_reduce_w_0, padding=[0, 0, 0, 0], channels=96, kernel_size=[1, 1]);
  %16 = nn.bias_add(%15, %inception_3a/3x3_reduce_b_0);
  %17 = nn.relu(%16);
  %18 = nn.conv2d(%17, %inception_3a/3x3_w_0, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]);
  %19 = nn.bias_add(%18, %inception_3a/3x3_b_0);
  %20 = nn.conv2d(%12, %inception_3a/5x5_reduce_w_0, padding=[0, 0, 0, 0], channels=16, kernel_size=[1, 1]);
  %21 = nn.bias_add(%20, %inception_3a/5x5_reduce_b_0);
  %22 = nn.relu(%21);
  %23 = nn.conv2d(%22, %inception_3a/5x5_w_0, padding=[2, 2, 2, 2], channels=32, kernel_size=[5, 5]);
  %24 = nn.bias_add(%23, %inception_3a/5x5_b_0);
  %25 = nn.max_pool2d(%12, pool_size=[3, 3], padding=[1, 1, 1, 1]);
  %26 = nn.conv2d(%25, %inception_3a/pool_proj_w_0, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]);
  %27 = nn.bias_add(%26, %inception_3a/pool_proj_b_0);
  %28 = nn.relu(%14);
  %29 = nn.relu(%19);
  %30 = nn.relu(%24);
  %31 = nn.relu(%27);
  %32 = (%28, %29, %30, %31);
  %33 = concatenate(%32, axis=1);
  %34 = nn.conv2d(%33, %inception_3b/1x1_w_0, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]);
  %35 = nn.bias_add(%34, %inception_3b/1x1_b_0);
  %36 = nn.conv2d(%33, %inception_3b/3x3_reduce_w_0, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]);
  %37 = nn.bias_add(%36, %inception_3b/3x3_reduce_b_0);
  %38 = nn.relu(%37);
  %39 = nn.conv2d(%38, %inception_3b/3x3_w_0, padding=[1, 1, 1, 1], channels=192, kernel_size=[3, 3]);
  %40 = nn.bias_add(%39, %inception_3b/3x3_b_0);
  %41 = nn.conv2d(%33, %inception_3b/5x5_reduce_w_0, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]);
  %42 = nn.bias_add(%41, %inception_3b/5x5_reduce_b_0);
  %43 = nn.relu(%42);
  %44 = nn.conv2d(%43, %inception_3b/5x5_w_0, padding=[2, 2, 2, 2], channels=96, kernel_size=[5, 5]);
  %45 = nn.bias_add(%44, %inception_3b/5x5_b_0);
  %46 = nn.max_pool2d(%33, pool_size=[3, 3], padding=[1, 1, 1, 1]);
  %47 = nn.conv2d(%46, %inception_3b/pool_proj_w_0, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]);
  %48 = nn.bias_add(%47, %inception_3b/pool_proj_b_0);
  %49 = nn.relu(%35);
  %50 = nn.relu(%40);
  %51 = nn.relu(%45);
  %52 = nn.relu(%48);
  %53 = (%49, %50, %51, %52);
  %54 = concatenate(%53, axis=1);
  %55 = nn.max_pool2d(%54, pool_size=[3, 3], strides=[2, 2], padding=[0, 0, 2, 2]);
  %56 = nn.conv2d(%55, %inception_4a/1x1_w_0, padding=[0, 0, 0, 0], channels=192, kernel_size=[1, 1]);
  %57 = nn.bias_add(%56, %inception_4a/1x1_b_0);
  %58 = nn.conv2d(%55, %inception_4a/3x3_reduce_w_0, padding=[0, 0, 0, 0], channels=96, kernel_size=[1, 1]);
  %59 = nn.bias_add(%58, %inception_4a/3x3_reduce_b_0);
  %60 = nn.relu(%59);
  %61 = nn.conv2d(%60, %inception_4a/3x3_w_0, padding=[1, 1, 1, 1], channels=208, kernel_size=[3, 3]);
  %62 = nn.bias_add(%61, %inception_4a/3x3_b_0);
  %63 = nn.conv2d(%55, %inception_4a/5x5_reduce_w_0, padding=[0, 0, 0, 0], channels=16, kernel_size=[1, 1]);
  %64 = nn.bias_add(%63, %inception_4a/5x5_reduce_b_0);
  %65 = nn.relu(%64);
  %66 = nn.conv2d(%65, %inception_4a/5x5_w_0, padding=[2, 2, 2, 2], channels=48, kernel_size=[5, 5]);
  %67 = nn.bias_add(%66, %inception_4a/5x5_b_0);
  %68 = nn.max_pool2d(%55, pool_size=[3, 3], padding=[1, 1, 1, 1]);
  %69 = nn.conv2d(%68, %inception_4a/pool_proj_w_0, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]);
  %70 = nn.bias_add(%69, %inception_4a/pool_proj_b_0);
  %71 = nn.relu(%57);
  %72 = nn.relu(%62);
  %73 = nn.relu(%67);
  %74 = nn.relu(%70);
  %75 = (%71, %72, %73, %74);
  %76 = concatenate(%75, axis=1);
  %77 = nn.conv2d(%76, %inception_4b/1x1_w_0, padding=[0, 0, 0, 0], channels=160, kernel_size=[1, 1]);
  %78 = nn.bias_add(%77, %inception_4b/1x1_b_0);
  %79 = nn.conv2d(%76, %inception_4b/3x3_reduce_w_0, padding=[0, 0, 0, 0], channels=112, kernel_size=[1, 1]);
  %80 = nn.bias_add(%79, %inception_4b/3x3_reduce_b_0);
  %81 = nn.relu(%80);
  %82 = nn.conv2d(%81, %inception_4b/3x3_w_0, padding=[1, 1, 1, 1], channels=224, kernel_size=[3, 3]);
  %83 = nn.bias_add(%82, %inception_4b/3x3_b_0);
  %84 = nn.conv2d(%76, %inception_4b/5x5_reduce_w_0, padding=[0, 0, 0, 0], channels=24, kernel_size=[1, 1]);
  %85 = nn.bias_add(%84, %inception_4b/5x5_reduce_b_0);
  %86 = nn.relu(%85);
  %87 = nn.conv2d(%86, %inception_4b/5x5_w_0, padding=[2, 2, 2, 2], channels=64, kernel_size=[5, 5]);
  %88 = nn.bias_add(%87, %inception_4b/5x5_b_0);
  %89 = nn.max_pool2d(%76, pool_size=[3, 3], padding=[1, 1, 1, 1]);
  %90 = nn.conv2d(%89, %inception_4b/pool_proj_w_0, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]);
  %91 = nn.bias_add(%90, %inception_4b/pool_proj_b_0);
  %92 = nn.relu(%78);
  %93 = nn.relu(%83);
  %94 = nn.relu(%88);
  %95 = nn.relu(%91);
  %96 = (%92, %93, %94, %95);
  %97 = concatenate(%96, axis=1);
  %98 = nn.conv2d(%97, %inception_4c/1x1_w_0, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]);
  %99 = nn.bias_add(%98, %inception_4c/1x1_b_0);
  %100 = nn.conv2d(%97, %inception_4c/3x3_reduce_w_0, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]);
  %101 = nn.bias_add(%100, %inception_4c/3x3_reduce_b_0);
  %102 = nn.relu(%101);
  %103 = nn.conv2d(%102, %inception_4c/3x3_w_0, padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %104 = nn.bias_add(%103, %inception_4c/3x3_b_0);
  %105 = nn.conv2d(%97, %inception_4c/5x5_reduce_w_0, padding=[0, 0, 0, 0], channels=24, kernel_size=[1, 1]);
  %106 = nn.bias_add(%105, %inception_4c/5x5_reduce_b_0);
  %107 = nn.relu(%106);
  %108 = nn.conv2d(%107, %inception_4c/5x5_w_0, padding=[2, 2, 2, 2], channels=64, kernel_size=[5, 5]);
  %109 = nn.bias_add(%108, %inception_4c/5x5_b_0);
  %110 = nn.max_pool2d(%97, pool_size=[3, 3], padding=[1, 1, 1, 1]);
  %111 = nn.conv2d(%110, %inception_4c/pool_proj_w_0, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]);
  %112 = nn.bias_add(%111, %inception_4c/pool_proj_b_0);
  %113 = nn.relu(%99);
  %114 = nn.relu(%104);
  %115 = nn.relu(%109);
  %116 = nn.relu(%112);
  %117 = (%113, %114, %115, %116);
  %118 = concatenate(%117, axis=1);
  %119 = nn.conv2d(%118, %inception_4d/1x1_w_0, padding=[0, 0, 0, 0], channels=112, kernel_size=[1, 1]);
  %120 = nn.bias_add(%119, %inception_4d/1x1_b_0);
  %121 = nn.conv2d(%118, %inception_4d/3x3_reduce_w_0, padding=[0, 0, 0, 0], channels=144, kernel_size=[1, 1]);
  %122 = nn.bias_add(%121, %inception_4d/3x3_reduce_b_0);
  %123 = nn.relu(%122);
  %124 = nn.conv2d(%123, %inception_4d/3x3_w_0, padding=[1, 1, 1, 1], channels=288, kernel_size=[3, 3]);
  %125 = nn.bias_add(%124, %inception_4d/3x3_b_0);
  %126 = nn.conv2d(%118, %inception_4d/5x5_reduce_w_0, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]);
  %127 = nn.bias_add(%126, %inception_4d/5x5_reduce_b_0);
  %128 = nn.relu(%127);
  %129 = nn.conv2d(%128, %inception_4d/5x5_w_0, padding=[2, 2, 2, 2], channels=64, kernel_size=[5, 5]);
  %130 = nn.bias_add(%129, %inception_4d/5x5_b_0);
  %131 = nn.max_pool2d(%118, pool_size=[3, 3], padding=[1, 1, 1, 1]);
  %132 = nn.conv2d(%131, %inception_4d/pool_proj_w_0, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]);
  %133 = nn.bias_add(%132, %inception_4d/pool_proj_b_0);
  %134 = nn.relu(%120);
  %135 = nn.relu(%125);
  %136 = nn.relu(%130);
  %137 = nn.relu(%133);
  %138 = (%134, %135, %136, %137);
  %139 = concatenate(%138, axis=1);
  %140 = nn.conv2d(%139, %inception_4e/1x1_w_0, padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %141 = nn.bias_add(%140, %inception_4e/1x1_b_0);
  %142 = nn.conv2d(%139, %inception_4e/3x3_reduce_w_0, padding=[0, 0, 0, 0], channels=160, kernel_size=[1, 1]);
  %143 = nn.bias_add(%142, %inception_4e/3x3_reduce_b_0);
  %144 = nn.relu(%143);
  %145 = nn.conv2d(%144, %inception_4e/3x3_w_0, padding=[1, 1, 1, 1], channels=320, kernel_size=[3, 3]);
  %146 = nn.bias_add(%145, %inception_4e/3x3_b_0);
  %147 = nn.conv2d(%139, %inception_4e/5x5_reduce_w_0, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]);
  %148 = nn.bias_add(%147, %inception_4e/5x5_reduce_b_0);
  %149 = nn.relu(%148);
  %150 = nn.conv2d(%149, %inception_4e/5x5_w_0, padding=[2, 2, 2, 2], channels=128, kernel_size=[5, 5]);
  %151 = nn.bias_add(%150, %inception_4e/5x5_b_0);
  %152 = nn.max_pool2d(%139, pool_size=[3, 3], padding=[1, 1, 1, 1]);
  %153 = nn.conv2d(%152, %inception_4e/pool_proj_w_0, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]);
  %154 = nn.bias_add(%153, %inception_4e/pool_proj_b_0);
  %155 = nn.relu(%141);
  %156 = nn.relu(%146);
  %157 = nn.relu(%151);
  %158 = nn.relu(%154);
  %159 = (%155, %156, %157, %158);
  %160 = concatenate(%159, axis=1);
  %161 = nn.max_pool2d(%160, pool_size=[3, 3], strides=[2, 2], padding=[0, 0, 2, 2]);
  %162 = nn.conv2d(%161, %inception_5a/1x1_w_0, padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %163 = nn.bias_add(%162, %inception_5a/1x1_b_0);
  %164 = nn.conv2d(%161, %inception_5a/3x3_reduce_w_0, padding=[0, 0, 0, 0], channels=160, kernel_size=[1, 1]);
  %165 = nn.bias_add(%164, %inception_5a/3x3_reduce_b_0);
  %166 = nn.relu(%165);
  %167 = nn.conv2d(%166, %inception_5a/3x3_w_0, padding=[1, 1, 1, 1], channels=320, kernel_size=[3, 3]);
  %168 = nn.bias_add(%167, %inception_5a/3x3_b_0);
  %169 = nn.conv2d(%161, %inception_5a/5x5_reduce_w_0, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]);
  %170 = nn.bias_add(%169, %inception_5a/5x5_reduce_b_0);
  %171 = nn.relu(%170);
  %172 = nn.conv2d(%171, %inception_5a/5x5_w_0, padding=[2, 2, 2, 2], channels=128, kernel_size=[5, 5]);
  %173 = nn.bias_add(%172, %inception_5a/5x5_b_0);
  %174 = nn.max_pool2d(%161, pool_size=[3, 3], padding=[1, 1, 1, 1]);
  %175 = nn.conv2d(%174, %inception_5a/pool_proj_w_0, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]);
  %176 = nn.bias_add(%175, %inception_5a/pool_proj_b_0);
  %177 = nn.relu(%163);
  %178 = nn.relu(%168);
  %179 = nn.relu(%173);
  %180 = nn.relu(%176);
  %181 = (%177, %178, %179, %180);
  %182 = concatenate(%181, axis=1);
  %183 = nn.conv2d(%182, %inception_5b/1x1_w_0, padding=[0, 0, 0, 0], channels=384, kernel_size=[1, 1]);
  %184 = nn.bias_add(%183, %inception_5b/1x1_b_0);
  %185 = nn.conv2d(%182, %inception_5b/3x3_reduce_w_0, padding=[0, 0, 0, 0], channels=192, kernel_size=[1, 1]);
  %186 = nn.bias_add(%185, %inception_5b/3x3_reduce_b_0);
  %187 = nn.relu(%186);
  %188 = nn.conv2d(%187, %inception_5b/3x3_w_0, padding=[1, 1, 1, 1], channels=384, kernel_size=[3, 3]);
  %189 = nn.bias_add(%188, %inception_5b/3x3_b_0);
  %190 = nn.conv2d(%182, %inception_5b/5x5_reduce_w_0, padding=[0, 0, 0, 0], channels=48, kernel_size=[1, 1]);
  %191 = nn.bias_add(%190, %inception_5b/5x5_reduce_b_0);
  %192 = nn.relu(%191);
  %193 = nn.conv2d(%192, %inception_5b/5x5_w_0, padding=[2, 2, 2, 2], channels=128, kernel_size=[5, 5]);
  %194 = nn.bias_add(%193, %inception_5b/5x5_b_0);
  %195 = nn.max_pool2d(%182, pool_size=[3, 3], padding=[1, 1, 1, 1]);
  %196 = nn.conv2d(%195, %inception_5b/pool_proj_w_0, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]);
  %197 = nn.bias_add(%196, %inception_5b/pool_proj_b_0);
  %198 = nn.relu(%184);
  %199 = nn.relu(%189);
  %200 = nn.relu(%194);
  %201 = nn.relu(%197);
  %202 = (%198, %199, %200, %201);
  %203 = concatenate(%202, axis=1);
  %204 = nn.avg_pool2d(%203, pool_size=[7, 7], padding=[0, 0, 0, 0]);
  %205 = nn.dropout(%204, rate=0.4f);
  %206 = %205.0;
  %207 = reshape(%206, newshape=[1, 1024]);
  %208 = nn.batch_flatten(%207);
  %209 = nn.dense(%208, %loss3/classifier_w_0, units=1000);
  %210 = multiply(1f, %loss3/classifier_b_0);
  %211 = add(%209, %210);
  %212 = max(%211, axis=[1], keepdims=True);
  %213 = subtract(%211, %212);
  %214 = exp(%213);
  %215 = sum(%214, axis=[1], keepdims=True);
  divide(%214, %215)
}