def @main(%conv2/3x3_b_0: Tensor[(192), float32], %call_6: Tensor[(1, 64, 56, 56), float32], %conv2/3x3_w_0: Tensor[(192, 64, 3, 3), float32] {
  %7 = nn.relu(%6) /* ty=Tensor[(1, 64, 56, 56), float32] */;
  %8 = nn.conv2d(%7, %conv2/3x3_w_0, padding=[1, 1, 1, 1], channels=192, kernel_size=[3, 3]) /* ty=Tensor[(1, 192, 56, 56), float32] */;
  %9 = nn.bias_add(%8, %conv2/3x3_b_0) /* ty=Tensor[(1, 192, 56, 56), float32] */;
  nn.relu(%9) /* ty=Tensor[(1, 192, 56, 56), float32] */;
}