def @main(%image: Tensor[(3, 224, 224), float32]) {
  %0 = expand_dims(%image, axis=0);
  %1 = nn.conv2d(%0, meta[relay.Constant][0], strides=[2, 2], padding=[3, 3, 3, 3], channels=64, kernel_size=[7, 7]);
  %2 = multiply(%1, meta[relay.Constant][1]);
  %3 = add(%2, meta[relay.Constant][2]);
  %4 = nn.relu(%3);
  %5 = nn.max_pool2d(%4, pool_size=[3, 3], strides=[2, 2], padding=[1, 1, 1, 1]);
  %6 = nn.conv2d(%5, meta[relay.Constant][3], padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]);
  %7 = multiply(%6, meta[relay.Constant][4]);
  %8 = add(%7, meta[relay.Constant][5]);
  %9 = nn.relu(%8);
  %10 = nn.conv2d(%9, meta[relay.Constant][6], padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]);
  %11 = multiply(%10, meta[relay.Constant][7]);
  %12 = add(%11, meta[relay.Constant][8]);
  %13 = nn.relu(%12);
  %14 = nn.conv2d(%13, meta[relay.Constant][9], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %15 = multiply(%14, meta[relay.Constant][10]);
  %16 = nn.conv2d(%5, meta[relay.Constant][12], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %17 = multiply(%16, meta[relay.Constant][13]);
  %18 = add(%15, meta[relay.Constant][11]);
  %19 = add(%17, meta[relay.Constant][14]);
  %20 = add(%18, %19);
  %21 = nn.relu(%20);
  %22 = nn.conv2d(%21, meta[relay.Constant][15], padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]);
  %23 = multiply(%22, meta[relay.Constant][16]);
  %24 = add(%23, meta[relay.Constant][17]);
  %25 = nn.relu(%24);
  %26 = nn.conv2d(%25, meta[relay.Constant][18], padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]);
  %27 = multiply(%26, meta[relay.Constant][19]);
  %28 = add(%27, meta[relay.Constant][20]);
  %29 = nn.relu(%28);
  %30 = nn.conv2d(%29, meta[relay.Constant][21], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %31 = multiply(%30, meta[relay.Constant][22]);
  %32 = add(%31, meta[relay.Constant][23]);
  %33 = add(%32, %21);
  %34 = nn.relu(%33);
  %35 = nn.conv2d(%34, meta[relay.Constant][24], padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]);
  %36 = multiply(%35, meta[relay.Constant][25]);
  %37 = add(%36, meta[relay.Constant][26]);
  %38 = nn.relu(%37);
  %39 = nn.conv2d(%38, meta[relay.Constant][27], padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]);
  %40 = multiply(%39, meta[relay.Constant][28]);
  %41 = add(%40, meta[relay.Constant][29]);
  %42 = nn.relu(%41);
  %43 = nn.conv2d(%42, meta[relay.Constant][30], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %44 = multiply(%43, meta[relay.Constant][31]);
  %45 = add(%44, meta[relay.Constant][32]);
  %46 = add(%45, %34);
  %47 = nn.relu(%46);
  %48 = nn.conv2d(%47, meta[relay.Constant][33], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %49 = nn.conv2d(%47, meta[relay.Constant][35], strides=[2, 2], padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]);
  %50 = multiply(%49, meta[relay.Constant][36]);
  %51 = add(%50, meta[relay.Constant][37]);
  %52 = nn.relu(%51);
  %53 = nn.conv2d(%52, meta[relay.Constant][38], padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]);
  %54 = multiply(%53, meta[relay.Constant][39]);
  %55 = add(%54, meta[relay.Constant][40]);
  %56 = nn.relu(%55);
  %57 = nn.conv2d(%56, meta[relay.Constant][41], padding=[0, 0, 0, 0], channels=512, kernel_size=[1, 1]);
  %58 = multiply(%57, meta[relay.Constant][42]);
  %59 = nn.conv2d(%47, meta[relay.Constant][44], strides=[2, 2], padding=[0, 0, 0, 0], channels=512, kernel_size=[1, 1]);
  %60 = multiply(%59, meta[relay.Constant][45]);
  %61 = add(%58, meta[relay.Constant][43]);
  %62 = add(%60, meta[relay.Constant][46]);
  %63 = add(%61, %62);
  %64 = nn.relu(%63);
  %65 = nn.conv2d(%64, meta[relay.Constant][47], padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]);
  %66 = multiply(%65, meta[relay.Constant][48]);
  %67 = add(%66, meta[relay.Constant][49]);
  %68 = nn.relu(%67);
  %69 = nn.conv2d(%68, meta[relay.Constant][50], padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]);
  %70 = multiply(%69, meta[relay.Constant][51]);
  %71 = add(%70, meta[relay.Constant][52]);
  %72 = nn.relu(%71);
  %73 = nn.conv2d(%72, meta[relay.Constant][53], padding=[0, 0, 0, 0], channels=512, kernel_size=[1, 1]);
  %74 = multiply(%73, meta[relay.Constant][54]);
  %75 = add(%74, meta[relay.Constant][55]);
  %76 = add(%75, %64);
  %77 = nn.relu(%76);
  %78 = nn.conv2d(%77, meta[relay.Constant][56], padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]);
  %79 = multiply(%78, meta[relay.Constant][57]);
  %80 = add(%79, meta[relay.Constant][58]);
  %81 = nn.relu(%80);
  %82 = nn.conv2d(%81, meta[relay.Constant][59], padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]);
  %83 = multiply(%82, meta[relay.Constant][60]);
  %84 = add(%83, meta[relay.Constant][61]);
  %85 = nn.relu(%84);
  %86 = nn.conv2d(%85, meta[relay.Constant][62], padding=[0, 0, 0, 0], channels=512, kernel_size=[1, 1]);
  %87 = multiply(%86, meta[relay.Constant][63]);
  %88 = add(%87, meta[relay.Constant][64]);
  %89 = add(%88, %77);
  %90 = nn.relu(%89);
  %91 = nn.conv2d(%90, meta[relay.Constant][65], padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]);
  %92 = multiply(%91, meta[relay.Constant][66]);
  %93 = add(%92, meta[relay.Constant][67]);
  %94 = nn.relu(%93);
  %95 = nn.conv2d(%94, meta[relay.Constant][68], padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]);
  %96 = multiply(%95, meta[relay.Constant][69]);
  %97 = add(%96, meta[relay.Constant][70]);
  %98 = nn.relu(%97);
  %99 = nn.conv2d(%98, meta[relay.Constant][71], padding=[0, 0, 0, 0], channels=512, kernel_size=[1, 1]);
  %100 = multiply(%99, meta[relay.Constant][72]);
  %101 = add(%100, meta[relay.Constant][73]);
  %102 = add(%101, %90);
  %103 = nn.relu(%102);
  %104 = nn.conv2d(%103, meta[relay.Constant][74], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %105 = nn.conv2d(%103, meta[relay.Constant][76], strides=[2, 2], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %106 = multiply(%105, meta[relay.Constant][77]);
  %107 = add(%106, meta[relay.Constant][78]);
  %108 = nn.relu(%107);
  %109 = nn.conv2d(%108, meta[relay.Constant][79], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %110 = multiply(%109, meta[relay.Constant][80]);
  %111 = add(%110, meta[relay.Constant][81]);
  %112 = nn.relu(%111);
  %113 = nn.conv2d(%112, meta[relay.Constant][82], padding=[0, 0, 0, 0], channels=1024, kernel_size=[1, 1]);
  %114 = multiply(%113, meta[relay.Constant][83]);
  %115 = nn.conv2d(%103, meta[relay.Constant][85], strides=[2, 2], padding=[0, 0, 0, 0], channels=1024, kernel_size=[1, 1]);
  %116 = multiply(%115, meta[relay.Constant][86]);
  %117 = add(%114, meta[relay.Constant][84]);
  %118 = add(%116, meta[relay.Constant][87]);
  %119 = add(%117, %118);
  %120 = nn.relu(%119);
  %121 = nn.conv2d(%120, meta[relay.Constant][88], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %122 = multiply(%121, meta[relay.Constant][89]);
  %123 = add(%122, meta[relay.Constant][90]);
  %124 = nn.relu(%123);
  %125 = nn.conv2d(%124, meta[relay.Constant][91], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %126 = multiply(%125, meta[relay.Constant][92]);
  %127 = add(%126, meta[relay.Constant][93]);
  %128 = nn.relu(%127);
  %129 = nn.conv2d(%128, meta[relay.Constant][94], padding=[0, 0, 0, 0], channels=1024, kernel_size=[1, 1]);
  %130 = multiply(%129, meta[relay.Constant][95]);
  %131 = add(%130, meta[relay.Constant][96]);
  %132 = add(%131, %120);
  %133 = nn.relu(%132);
  %134 = nn.conv2d(%133, meta[relay.Constant][97], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %135 = multiply(%134, meta[relay.Constant][98]);
  %136 = add(%135, meta[relay.Constant][99]);
  %137 = nn.relu(%136);
  %138 = nn.conv2d(%137, meta[relay.Constant][100], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %139 = multiply(%138, meta[relay.Constant][101]);
  %140 = add(%139, meta[relay.Constant][102]);
  %141 = nn.relu(%140);
  %142 = nn.conv2d(%141, meta[relay.Constant][103], padding=[0, 0, 0, 0], channels=1024, kernel_size=[1, 1]);
  %143 = multiply(%142, meta[relay.Constant][104]);
  %144 = add(%143, meta[relay.Constant][105]);
  %145 = add(%144, %133);
  %146 = nn.relu(%145);
  %147 = nn.conv2d(%146, meta[relay.Constant][106], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %148 = multiply(%147, meta[relay.Constant][107]);
  %149 = add(%148, meta[relay.Constant][108]);
  %150 = nn.relu(%149);
  %151 = nn.conv2d(%150, meta[relay.Constant][109], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %152 = multiply(%151, meta[relay.Constant][110]);
  %153 = add(%152, meta[relay.Constant][111]);
  %154 = nn.relu(%153);
  %155 = nn.conv2d(%154, meta[relay.Constant][112], padding=[0, 0, 0, 0], channels=1024, kernel_size=[1, 1]);
  %156 = multiply(%155, meta[relay.Constant][113]);
  %157 = add(%156, meta[relay.Constant][114]);
  %158 = add(%157, %146);
  %159 = nn.relu(%158);
  %160 = nn.conv2d(%159, meta[relay.Constant][115], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %161 = multiply(%160, meta[relay.Constant][116]);
  %162 = add(%161, meta[relay.Constant][117]);
  %163 = nn.relu(%162);
  %164 = nn.conv2d(%163, meta[relay.Constant][118], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %165 = multiply(%164, meta[relay.Constant][119]);
  %166 = add(%165, meta[relay.Constant][120]);
  %167 = nn.relu(%166);
  %168 = nn.conv2d(%167, meta[relay.Constant][121], padding=[0, 0, 0, 0], channels=1024, kernel_size=[1, 1]);
  %169 = multiply(%168, meta[relay.Constant][122]);
  %170 = add(%169, meta[relay.Constant][123]);
  %171 = add(%170, %159);
  %172 = nn.relu(%171);
  %173 = nn.conv2d(%172, meta[relay.Constant][124], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %174 = multiply(%173, meta[relay.Constant][125]);
  %175 = add(%174, meta[relay.Constant][126]);
  %176 = nn.relu(%175);
  %177 = nn.conv2d(%176, meta[relay.Constant][127], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %178 = multiply(%177, meta[relay.Constant][128]);
  %179 = add(%178, meta[relay.Constant][129]);
  %180 = nn.relu(%179);
  %181 = nn.conv2d(%180, meta[relay.Constant][130], padding=[0, 0, 0, 0], channels=1024, kernel_size=[1, 1]);
  %182 = multiply(%181, meta[relay.Constant][131]);
  %183 = add(%182, meta[relay.Constant][132]);
  %184 = add(%183, %172);
  %185 = nn.relu(%184);
  %186 = nn.conv2d(%185, meta[relay.Constant][133], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %187 = nn.conv2d(%185, meta[relay.Constant][135], strides=[2, 2], padding=[0, 0, 0, 0], channels=512, kernel_size=[1, 1]);
  %188 = multiply(%187, meta[relay.Constant][136]);
  %189 = add(%188, meta[relay.Constant][137]);
  %190 = nn.relu(%189);
  %191 = nn.conv2d(%190, meta[relay.Constant][138], padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]);
  %192 = multiply(%191, meta[relay.Constant][139]);
  %193 = add(%192, meta[relay.Constant][140]);
  %194 = nn.relu(%193);
  %195 = nn.conv2d(%194, meta[relay.Constant][141], padding=[0, 0, 0, 0], channels=2048, kernel_size=[1, 1]);
  %196 = multiply(%195, meta[relay.Constant][142]);
  %197 = nn.conv2d(%185, meta[relay.Constant][144], strides=[2, 2], padding=[0, 0, 0, 0], channels=2048, kernel_size=[1, 1]);
  %198 = multiply(%197, meta[relay.Constant][145]);
  %199 = add(%196, meta[relay.Constant][143]);
  %200 = add(%198, meta[relay.Constant][146]);
  %201 = add(%199, %200);
  %202 = nn.relu(%201);
  %203 = nn.conv2d(%202, meta[relay.Constant][147], padding=[0, 0, 0, 0], channels=512, kernel_size=[1, 1]);
  %204 = multiply(%203, meta[relay.Constant][148]);
  %205 = add(%204, meta[relay.Constant][149]);
  %206 = nn.relu(%205);
  %207 = nn.conv2d(%206, meta[relay.Constant][150], padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]);
  %208 = multiply(%207, meta[relay.Constant][151]);
  %209 = add(%208, meta[relay.Constant][152]);
  %210 = nn.relu(%209);
  %211 = nn.conv2d(%210, meta[relay.Constant][153], padding=[0, 0, 0, 0], channels=2048, kernel_size=[1, 1]);
  %212 = multiply(%211, meta[relay.Constant][154]);
  %213 = add(%212, meta[relay.Constant][155]);
  %214 = add(%213, %202);
  %215 = nn.relu(%214);
  %216 = nn.conv2d(%215, meta[relay.Constant][156], padding=[0, 0, 0, 0], channels=512, kernel_size=[1, 1]);
  %217 = multiply(%216, meta[relay.Constant][157]);
  %218 = add(%217, meta[relay.Constant][158]);
  %219 = nn.relu(%218);
  %220 = nn.conv2d(%219, meta[relay.Constant][159], padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]);
  %221 = multiply(%220, meta[relay.Constant][160]);
  %222 = add(%221, meta[relay.Constant][161]);
  %223 = nn.relu(%222);
  %224 = nn.conv2d(%223, meta[relay.Constant][162], padding=[0, 0, 0, 0], channels=2048, kernel_size=[1, 1]);
  %225 = multiply(%224, meta[relay.Constant][163]);
  %226 = add(%225, meta[relay.Constant][164]);
  %227 = add(%226, %215);
  %228 = nn.relu(%227);
  %229 = nn.conv2d(%228, meta[relay.Constant][165], padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]);
  %230 = nn.bias_add(%229, meta[relay.Constant][166]);
  %231 = nn.bias_add(%186, meta[relay.Constant][134]);
  %232 = image.resize2d(%230, size=[14, 14], method="nearest_neighbor", coordinate_transformation_mode="asymmetric", rounding_method="");
  %233 = add(%231, %232);
  %234 = nn.bias_add(%104, meta[relay.Constant][75]);
  %235 = image.resize2d(%233, size=[28, 28], method="nearest_neighbor", coordinate_transformation_mode="asymmetric", rounding_method="");
  %236 = add(%234, %235);
  %237 = nn.bias_add(%48, meta[relay.Constant][34]);
  %238 = image.resize2d(%236, size=[56, 56], method="nearest_neighbor", coordinate_transformation_mode="asymmetric", rounding_method="");
  %239 = add(%237, %238);
  %240 = nn.conv2d(%239, meta[relay.Constant][167], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %241 = nn.bias_add(%240, meta[relay.Constant][168]);
  %242 = nn.conv2d(%241, meta[relay.Constant][169], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %243 = nn.bias_add(%242, meta[relay.Constant][170]);
  %244 = nn.relu(%243);
  %245 = nn.conv2d(%244, meta[relay.Constant][171], padding=[0, 0, 0, 0], channels=12, kernel_size=[1, 1]);
  %246 = nn.bias_add(%245, meta[relay.Constant][172]);
  %247 = reshape(%246, newshape=[1, -1, 4, 56, 56]);
  %248 = transpose(%247, axes=[0, 3, 4, 1, 2]);
  %249 = nn.conv2d(%244, meta[relay.Constant][173], padding=[0, 0, 0, 0], channels=3, kernel_size=[1, 1]);
  %250 = nn.bias_add(%249, meta[relay.Constant][174]);
  %251 = reshape(%250, newshape=[1, -1, 1, 56, 56]);
  %252 = transpose(%251, axes=[0, 3, 4, 1, 2]);
  %253 = reshape(%252, newshape=[1, -1, 1]);
  %254 = reshape(%253, newshape=[1, -1]);
  %255 = sigmoid(%254);
  %256 = topk(%255, k=1000, axis=1, dtype="int64");
  %257 = %256.1;
  %258 = squeeze(%257, axis=[0]);
  %259 = reshape(%248, newshape=[1, -1, 4]);
  %260 = shape_of(%259, dtype="int64");
  %261 = take(%260, 1);
  %262 = less(%258, 0);
  %263 = add(%258, %261);
  %264 = where(%262, %263, %258);
  %265 = take(%259, %264, axis=1);
  %266 = reshape(%265, newshape=[-1, 4]);
  %267 = strided_slice(%266, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %268 = less(%258, 0);
  %269 = add(%258, 9408);
  %270 = where(%268, %269, %258);
  %271 = take(meta[relay.Constant][175], %270, axis=1);
  %272 = reshape(%271, newshape=[-1, 4]);
  %273 = cast(%272, dtype="float32");
  %274 = strided_slice(%273, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %275 = strided_slice(%273, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %276 = take(%274, 2, axis=1);
  %277 = take(%275, 0, axis=1);
  %278 = subtract(%276, %277);
  %279 = add(%278, 1f);
  %280 = strided_slice(%279, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %281 = strided_slice(%267, begin=[0], end=[9223372036854775807], strides=[4], axes=[1]);
  %282 = expand_dims(%280, axis=1);
  %283 = strided_slice(%273, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %284 = take(%283, 0, axis=1);
  %285 = multiply(0.5f, %279);
  %286 = add(%284, %285);
  %287 = strided_slice(%286, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %288 = multiply(%281, %282);
  %289 = expand_dims(%287, axis=1);
  %290 = strided_slice(%266, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %291 = strided_slice(%290, begin=[2], end=[9223372036854775807], strides=[4], axes=[1]);
  %292 = clip(%291, a_min=-inff, a_max=4.13517f);
  %293 = strided_slice(%279, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %294 = exp(%292);
  %295 = expand_dims(%293, axis=1);
  %296 = multiply(%294, %295);
  %297 = add(%288, %289);
  %298 = multiply(%296, 0.5f);
  %299 = subtract(%297, %298);
  %300 = strided_slice(%266, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %301 = strided_slice(%273, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %302 = strided_slice(%273, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %303 = take(%301, 3, axis=1);
  %304 = take(%302, 1, axis=1);
  %305 = subtract(%303, %304);
  %306 = add(%305, 1f);
  %307 = strided_slice(%306, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %308 = strided_slice(%300, begin=[1], end=[9223372036854775807], strides=[4], axes=[1]);
  %309 = expand_dims(%307, axis=1);
  %310 = strided_slice(%273, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %311 = take(%310, 1, axis=1);
  %312 = multiply(0.5f, %306);
  %313 = add(%311, %312);
  %314 = strided_slice(%313, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %315 = multiply(%308, %309);
  %316 = expand_dims(%314, axis=1);
  %317 = strided_slice(%266, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %318 = strided_slice(%317, begin=[3], end=[9223372036854775807], strides=[4], axes=[1]);
  %319 = clip(%318, a_min=-inff, a_max=4.13517f);
  %320 = strided_slice(%306, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %321 = exp(%319);
  %322 = expand_dims(%320, axis=1);
  %323 = multiply(%321, %322);
  %324 = add(%315, %316);
  %325 = multiply(%323, 0.5f);
  %326 = subtract(%324, %325);
  %327 = multiply(%296, 0.5f);
  %328 = add(%297, %327);
  %329 = subtract(%328, 1f);
  %330 = multiply(%323, 0.5f);
  %331 = add(%324, %330);
  %332 = subtract(%331, 1f);
  %333 = expand_dims(%299, axis=2);
  %334 = expand_dims(%326, axis=2);
  %335 = expand_dims(%329, axis=2);
  %336 = expand_dims(%332, axis=2);
  %337 = (%333, %334, %335, %336);
  %338 = concatenate(%337, axis=2);
  %339 = reshape(%338, newshape=[1000, 4]);
  %340 = reshape(%339, newshape=[1, -1, 4]);
  %341 = take(%340, 0, axis=0);
  %342 = strided_slice(%341, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %343 = strided_slice(%342, begin=[0], end=[9223372036854775807], strides=[2], axes=[1]);
  %344 = clip(%343, a_min=0f, a_max=1279f);
  %345 = strided_slice(%341, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %346 = strided_slice(%345, begin=[1], end=[9223372036854775807], strides=[2], axes=[1]);
  %347 = clip(%346, a_min=0f, a_max=1279f);
  %348 = expand_dims(%344, axis=2);
  %349 = expand_dims(%347, axis=2);
  %350 = (%348, %349);
  %351 = concatenate(%350, axis=2);
  %352 = reshape(%351, newshape=[-1, 4]);
  %353 = %256.0;
  %354 = take(%353, 0, axis=0);
  %355 = expand_dims(%354, axis=0);
  %356 = expand_dims(%352, axis=0);
  %357 = expand_dims(%355, axis=0);
  %358 = vision.all_class_non_max_suppression(%356, %357, 2000, 0.7f, 0f);
  %359 = %358.0;
  %360 = shape_of(%359, dtype="int32");
  %361 = cast_like(%360, meta[relay.Constant][177]);
  %362 = slice_like(%361, meta[relay.Constant][177], axes=None);
  %363 = add(meta[relay.Constant][177], %362);
  %364 = where(meta[relay.Constant][176], %363, meta[relay.Constant][177]);
  %365 = greater_equal(%364, %362);
  %366 = where(%365, %362, %364);
  %367 = %358.1;
  %368 = dyn.strided_slice(%359, %366, %367, meta[relay.Constant][178], begin=None, end=None, strides=None, axes=None);
  %369 = take(%368, meta[relay.Constant][179], axis=1);
  %370 = squeeze(%369, axis=[1]);
  %371 = shape_of(%370, dtype="int32");
  %372 = cast_like(%371, meta[relay.Constant][181]);
  %373 = slice_like(%372, meta[relay.Constant][181], axes=None);
  %374 = add(meta[relay.Constant][181], %373);
  %375 = where(meta[relay.Constant][180], %374, meta[relay.Constant][181]);
  %376 = greater_equal(%375, %373);
  %377 = shape_of(%370, dtype="int64");
  %378 = where(%376, %373, %375);
  %379 = scatter(%377, meta[relay.Constant][182], meta[relay.Constant][183]);
  %380 = dyn.strided_slice(%370, %378, %379, meta[relay.Constant][184], begin=None, end=None, strides=None, axes=None);
  %381 = cast(%380, dtype="int64");
  %382 = shape_of(%352, dtype="int64");
  %383 = take(%382, 0);
  %384 = less(%381, 0);
  %385 = add(%381, %383);
  %386 = where(%384, %385, %381);
  %387 = nn.conv2d(%236, meta[relay.Constant][185], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %388 = nn.bias_add(%387, meta[relay.Constant][186]);
  %389 = nn.conv2d(%388, meta[relay.Constant][169], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %390 = nn.bias_add(%389, meta[relay.Constant][170]);
  %391 = nn.relu(%390);
  %392 = nn.conv2d(%391, meta[relay.Constant][171], padding=[0, 0, 0, 0], channels=12, kernel_size=[1, 1]);
  %393 = nn.bias_add(%392, meta[relay.Constant][172]);
  %394 = reshape(%393, newshape=[1, -1, 4, 28, 28]);
  %395 = transpose(%394, axes=[0, 3, 4, 1, 2]);
  %396 = nn.conv2d(%391, meta[relay.Constant][173], padding=[0, 0, 0, 0], channels=3, kernel_size=[1, 1]);
  %397 = nn.bias_add(%396, meta[relay.Constant][174]);
  %398 = reshape(%397, newshape=[1, -1, 1, 28, 28]);
  %399 = transpose(%398, axes=[0, 3, 4, 1, 2]);
  %400 = reshape(%399, newshape=[1, -1, 1]);
  %401 = reshape(%400, newshape=[1, -1]);
  %402 = sigmoid(%401);
  %403 = topk(%402, k=1000, axis=1, dtype="int64");
  %404 = %403.1;
  %405 = squeeze(%404, axis=[0]);
  %406 = reshape(%395, newshape=[1, -1, 4]);
  %407 = shape_of(%406, dtype="int64");
  %408 = take(%407, 1);
  %409 = less(%405, 0);
  %410 = add(%405, %408);
  %411 = where(%409, %410, %405);
  %412 = take(%406, %411, axis=1);
  %413 = reshape(%412, newshape=[-1, 4]);
  %414 = strided_slice(%413, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %415 = less(%405, 0);
  %416 = add(%405, 2352);
  %417 = where(%415, %416, %405);
  %418 = take(meta[relay.Constant][187], %417, axis=1);
  %419 = reshape(%418, newshape=[-1, 4]);
  %420 = cast(%419, dtype="float32");
  %421 = strided_slice(%420, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %422 = strided_slice(%420, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %423 = take(%421, 2, axis=1);
  %424 = take(%422, 0, axis=1);
  %425 = subtract(%423, %424);
  %426 = add(%425, 1f);
  %427 = strided_slice(%426, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %428 = strided_slice(%414, begin=[0], end=[9223372036854775807], strides=[4], axes=[1]);
  %429 = expand_dims(%427, axis=1);
  %430 = strided_slice(%420, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %431 = take(%430, 0, axis=1);
  %432 = multiply(0.5f, %426);
  %433 = add(%431, %432);
  %434 = strided_slice(%433, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %435 = multiply(%428, %429);
  %436 = expand_dims(%434, axis=1);
  %437 = strided_slice(%413, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %438 = strided_slice(%437, begin=[2], end=[9223372036854775807], strides=[4], axes=[1]);
  %439 = clip(%438, a_min=-inff, a_max=4.13517f);
  %440 = strided_slice(%426, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %441 = exp(%439);
  %442 = expand_dims(%440, axis=1);
  %443 = multiply(%441, %442);
  %444 = add(%435, %436);
  %445 = multiply(%443, 0.5f);
  %446 = subtract(%444, %445);
  %447 = strided_slice(%413, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %448 = strided_slice(%420, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %449 = strided_slice(%420, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %450 = take(%448, 3, axis=1);
  %451 = take(%449, 1, axis=1);
  %452 = subtract(%450, %451);
  %453 = add(%452, 1f);
  %454 = strided_slice(%453, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %455 = strided_slice(%447, begin=[1], end=[9223372036854775807], strides=[4], axes=[1]);
  %456 = expand_dims(%454, axis=1);
  %457 = strided_slice(%420, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %458 = take(%457, 1, axis=1);
  %459 = multiply(0.5f, %453);
  %460 = add(%458, %459);
  %461 = strided_slice(%460, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %462 = multiply(%455, %456);
  %463 = expand_dims(%461, axis=1);
  %464 = strided_slice(%413, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %465 = strided_slice(%464, begin=[3], end=[9223372036854775807], strides=[4], axes=[1]);
  %466 = clip(%465, a_min=-inff, a_max=4.13517f);
  %467 = strided_slice(%453, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %468 = exp(%466);
  %469 = expand_dims(%467, axis=1);
  %470 = multiply(%468, %469);
  %471 = add(%462, %463);
  %472 = multiply(%470, 0.5f);
  %473 = subtract(%471, %472);
  %474 = multiply(%443, 0.5f);
  %475 = add(%444, %474);
  %476 = subtract(%475, 1f);
  %477 = multiply(%470, 0.5f);
  %478 = add(%471, %477);
  %479 = subtract(%478, 1f);
  %480 = expand_dims(%446, axis=2);
  %481 = expand_dims(%473, axis=2);
  %482 = expand_dims(%476, axis=2);
  %483 = expand_dims(%479, axis=2);
  %484 = (%480, %481, %482, %483);
  %485 = concatenate(%484, axis=2);
  %486 = reshape(%485, newshape=[1000, 4]);
  %487 = reshape(%486, newshape=[1, -1, 4]);
  %488 = take(%487, 0, axis=0);
  %489 = strided_slice(%488, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %490 = strided_slice(%489, begin=[0], end=[9223372036854775807], strides=[2], axes=[1]);
  %491 = clip(%490, a_min=0f, a_max=1279f);
  %492 = strided_slice(%488, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %493 = strided_slice(%492, begin=[1], end=[9223372036854775807], strides=[2], axes=[1]);
  %494 = clip(%493, a_min=0f, a_max=1279f);
  %495 = expand_dims(%491, axis=2);
  %496 = expand_dims(%494, axis=2);
  %497 = (%495, %496);
  %498 = concatenate(%497, axis=2);
  %499 = reshape(%498, newshape=[-1, 4]);
  %500 = %403.0;
  %501 = take(%500, 0, axis=0);
  %502 = expand_dims(%501, axis=0);
  %503 = expand_dims(%499, axis=0);
  %504 = expand_dims(%502, axis=0);
  %505 = vision.all_class_non_max_suppression(%503, %504, 2000, 0.7f, 0f);
  %506 = %505.0;
  %507 = shape_of(%506, dtype="int32");
  %508 = cast_like(%507, meta[relay.Constant][189]);
  %509 = slice_like(%508, meta[relay.Constant][189], axes=None);
  %510 = add(meta[relay.Constant][189], %509);
  %511 = where(meta[relay.Constant][188], %510, meta[relay.Constant][189]);
  %512 = greater_equal(%511, %509);
  %513 = where(%512, %509, %511);
  %514 = %505.1;
  %515 = dyn.strided_slice(%506, %513, %514, meta[relay.Constant][190], begin=None, end=None, strides=None, axes=None);
  %516 = take(%515, meta[relay.Constant][191], axis=1);
  %517 = squeeze(%516, axis=[1]);
  %518 = shape_of(%517, dtype="int32");
  %519 = cast_like(%518, meta[relay.Constant][193]);
  %520 = slice_like(%519, meta[relay.Constant][193], axes=None);
  %521 = add(meta[relay.Constant][193], %520);
  %522 = where(meta[relay.Constant][192], %521, meta[relay.Constant][193]);
  %523 = greater_equal(%522, %520);
  %524 = shape_of(%517, dtype="int64");
  %525 = where(%523, %520, %522);
  %526 = scatter(%524, meta[relay.Constant][194], meta[relay.Constant][195]);
  %527 = dyn.strided_slice(%517, %525, %526, meta[relay.Constant][196], begin=None, end=None, strides=None, axes=None);
  %528 = cast(%527, dtype="int64");
  %529 = shape_of(%499, dtype="int64");
  %530 = take(%529, 0);
  %531 = less(%528, 0);
  %532 = add(%528, %530);
  %533 = where(%531, %532, %528);
  %534 = nn.conv2d(%233, meta[relay.Constant][197], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %535 = nn.bias_add(%534, meta[relay.Constant][198]);
  %536 = nn.conv2d(%535, meta[relay.Constant][169], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %537 = nn.bias_add(%536, meta[relay.Constant][170]);
  %538 = nn.relu(%537);
  %539 = nn.conv2d(%538, meta[relay.Constant][171], padding=[0, 0, 0, 0], channels=12, kernel_size=[1, 1]);
  %540 = nn.bias_add(%539, meta[relay.Constant][172]);
  %541 = reshape(%540, newshape=[1, -1, 4, 14, 14]);
  %542 = transpose(%541, axes=[0, 3, 4, 1, 2]);
  %543 = nn.conv2d(%538, meta[relay.Constant][173], padding=[0, 0, 0, 0], channels=3, kernel_size=[1, 1]);
  %544 = nn.bias_add(%543, meta[relay.Constant][174]);
  %545 = reshape(%544, newshape=[1, -1, 1, 14, 14]);
  %546 = transpose(%545, axes=[0, 3, 4, 1, 2]);
  %547 = reshape(%546, newshape=[1, -1, 1]);
  %548 = reshape(%547, newshape=[1, -1]);
  %549 = sigmoid(%548);
  %550 = topk(%549, k=588, axis=1, dtype="int64");
  %551 = %550.1;
  %552 = squeeze(%551, axis=[0]);
  %553 = reshape(%542, newshape=[1, -1, 4]);
  %554 = shape_of(%553, dtype="int64");
  %555 = take(%554, 1);
  %556 = less(%552, 0);
  %557 = add(%552, %555);
  %558 = where(%556, %557, %552);
  %559 = take(%553, %558, axis=1);
  %560 = reshape(%559, newshape=[-1, 4]);
  %561 = strided_slice(%560, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %562 = less(%552, 0);
  %563 = add(%552, 588);
  %564 = where(%562, %563, %552);
  %565 = take(meta[relay.Constant][199], %564, axis=1);
  %566 = reshape(%565, newshape=[-1, 4]);
  %567 = cast(%566, dtype="float32");
  %568 = strided_slice(%567, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %569 = strided_slice(%567, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %570 = take(%568, 2, axis=1);
  %571 = take(%569, 0, axis=1);
  %572 = subtract(%570, %571);
  %573 = add(%572, 1f);
  %574 = strided_slice(%573, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %575 = strided_slice(%561, begin=[0], end=[9223372036854775807], strides=[4], axes=[1]);
  %576 = expand_dims(%574, axis=1);
  %577 = strided_slice(%567, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %578 = take(%577, 0, axis=1);
  %579 = multiply(0.5f, %573);
  %580 = add(%578, %579);
  %581 = strided_slice(%580, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %582 = multiply(%575, %576);
  %583 = expand_dims(%581, axis=1);
  %584 = strided_slice(%560, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %585 = strided_slice(%584, begin=[2], end=[9223372036854775807], strides=[4], axes=[1]);
  %586 = clip(%585, a_min=-inff, a_max=4.13517f);
  %587 = strided_slice(%573, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %588 = exp(%586);
  %589 = expand_dims(%587, axis=1);
  %590 = multiply(%588, %589);
  %591 = add(%582, %583);
  %592 = multiply(%590, 0.5f);
  %593 = subtract(%591, %592);
  %594 = strided_slice(%560, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %595 = strided_slice(%567, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %596 = strided_slice(%567, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %597 = take(%595, 3, axis=1);
  %598 = take(%596, 1, axis=1);
  %599 = subtract(%597, %598);
  %600 = add(%599, 1f);
  %601 = strided_slice(%600, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %602 = strided_slice(%594, begin=[1], end=[9223372036854775807], strides=[4], axes=[1]);
  %603 = expand_dims(%601, axis=1);
  %604 = strided_slice(%567, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %605 = take(%604, 1, axis=1);
  %606 = multiply(0.5f, %600);
  %607 = add(%605, %606);
  %608 = strided_slice(%607, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %609 = multiply(%602, %603);
  %610 = expand_dims(%608, axis=1);
  %611 = strided_slice(%560, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %612 = strided_slice(%611, begin=[3], end=[9223372036854775807], strides=[4], axes=[1]);
  %613 = clip(%612, a_min=-inff, a_max=4.13517f);
  %614 = strided_slice(%600, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %615 = exp(%613);
  %616 = expand_dims(%614, axis=1);
  %617 = multiply(%615, %616);
  %618 = add(%609, %610);
  %619 = multiply(%617, 0.5f);
  %620 = subtract(%618, %619);
  %621 = multiply(%590, 0.5f);
  %622 = add(%591, %621);
  %623 = subtract(%622, 1f);
  %624 = multiply(%617, 0.5f);
  %625 = add(%618, %624);
  %626 = subtract(%625, 1f);
  %627 = expand_dims(%593, axis=2);
  %628 = expand_dims(%620, axis=2);
  %629 = expand_dims(%623, axis=2);
  %630 = expand_dims(%626, axis=2);
  %631 = (%627, %628, %629, %630);
  %632 = concatenate(%631, axis=2);
  %633 = reshape(%632, newshape=[588, 4]);
  %634 = reshape(%633, newshape=[1, -1, 4]);
  %635 = take(%634, 0, axis=0);
  %636 = strided_slice(%635, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %637 = strided_slice(%636, begin=[0], end=[9223372036854775807], strides=[2], axes=[1]);
  %638 = clip(%637, a_min=0f, a_max=1279f);
  %639 = strided_slice(%635, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %640 = strided_slice(%639, begin=[1], end=[9223372036854775807], strides=[2], axes=[1]);
  %641 = clip(%640, a_min=0f, a_max=1279f);
  %642 = expand_dims(%638, axis=2);
  %643 = expand_dims(%641, axis=2);
  %644 = (%642, %643);
  %645 = concatenate(%644, axis=2);
  %646 = reshape(%645, newshape=[-1, 4]);
  %647 = %550.0;
  %648 = take(%647, 0, axis=0);
  %649 = expand_dims(%648, axis=0);
  %650 = expand_dims(%646, axis=0);
  %651 = expand_dims(%649, axis=0);
  %652 = vision.all_class_non_max_suppression(%650, %651, 2000, 0.7f, 0f);
  %653 = %652.0;
  %654 = shape_of(%653, dtype="int32");
  %655 = cast_like(%654, meta[relay.Constant][201]);
  %656 = slice_like(%655, meta[relay.Constant][201], axes=None);
  %657 = add(meta[relay.Constant][201], %656);
  %658 = where(meta[relay.Constant][200], %657, meta[relay.Constant][201]);
  %659 = greater_equal(%658, %656);
  %660 = where(%659, %656, %658);
  %661 = %652.1;
  %662 = dyn.strided_slice(%653, %660, %661, meta[relay.Constant][202], begin=None, end=None, strides=None, axes=None);
  %663 = take(%662, meta[relay.Constant][203], axis=1);
  %664 = squeeze(%663, axis=[1]);
  %665 = shape_of(%664, dtype="int32");
  %666 = cast_like(%665, meta[relay.Constant][205]);
  %667 = slice_like(%666, meta[relay.Constant][205], axes=None);
  %668 = add(meta[relay.Constant][205], %667);
  %669 = where(meta[relay.Constant][204], %668, meta[relay.Constant][205]);
  %670 = greater_equal(%669, %667);
  %671 = shape_of(%664, dtype="int64");
  %672 = where(%670, %667, %669);
  %673 = scatter(%671, meta[relay.Constant][206], meta[relay.Constant][207]);
  %674 = dyn.strided_slice(%664, %672, %673, meta[relay.Constant][208], begin=None, end=None, strides=None, axes=None);
  %675 = cast(%674, dtype="int64");
  %676 = shape_of(%646, dtype="int64");
  %677 = take(%676, 0);
  %678 = less(%675, 0);
  %679 = add(%675, %677);
  %680 = where(%678, %679, %675);
  %681 = nn.conv2d(%230, meta[relay.Constant][209], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %682 = nn.bias_add(%681, meta[relay.Constant][210]);
  %683 = nn.conv2d(%682, meta[relay.Constant][169], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %684 = nn.bias_add(%683, meta[relay.Constant][170]);
  %685 = nn.relu(%684);
  %686 = nn.conv2d(%685, meta[relay.Constant][171], padding=[0, 0, 0, 0], channels=12, kernel_size=[1, 1]);
  %687 = nn.bias_add(%686, meta[relay.Constant][172]);
  %688 = reshape(%687, newshape=[1, -1, 4, 7, 7]);
  %689 = transpose(%688, axes=[0, 3, 4, 1, 2]);
  %690 = nn.conv2d(%685, meta[relay.Constant][173], padding=[0, 0, 0, 0], channels=3, kernel_size=[1, 1]);
  %691 = nn.bias_add(%690, meta[relay.Constant][174]);
  %692 = reshape(%691, newshape=[1, -1, 1, 7, 7]);
  %693 = transpose(%692, axes=[0, 3, 4, 1, 2]);
  %694 = reshape(%693, newshape=[1, -1, 1]);
  %695 = reshape(%694, newshape=[1, -1]);
  %696 = sigmoid(%695);
  %697 = topk(%696, k=147, axis=1, dtype="int64");
  %698 = %697.1;
  %699 = squeeze(%698, axis=[0]);
  %700 = reshape(%689, newshape=[1, -1, 4]);
  %701 = shape_of(%700, dtype="int64");
  %702 = take(%701, 1);
  %703 = less(%699, 0);
  %704 = add(%699, %702);
  %705 = where(%703, %704, %699);
  %706 = take(%700, %705, axis=1);
  %707 = reshape(%706, newshape=[-1, 4]);
  %708 = strided_slice(%707, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %709 = less(%699, 0);
  %710 = add(%699, 147);
  %711 = where(%709, %710, %699);
  %712 = take(meta[relay.Constant][211], %711, axis=1);
  %713 = reshape(%712, newshape=[-1, 4]);
  %714 = cast(%713, dtype="float32");
  %715 = strided_slice(%714, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %716 = strided_slice(%714, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %717 = take(%715, 2, axis=1);
  %718 = take(%716, 0, axis=1);
  %719 = subtract(%717, %718);
  %720 = add(%719, 1f);
  %721 = strided_slice(%720, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %722 = strided_slice(%708, begin=[0], end=[9223372036854775807], strides=[4], axes=[1]);
  %723 = expand_dims(%721, axis=1);
  %724 = strided_slice(%714, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %725 = take(%724, 0, axis=1);
  %726 = multiply(0.5f, %720);
  %727 = add(%725, %726);
  %728 = strided_slice(%727, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %729 = multiply(%722, %723);
  %730 = expand_dims(%728, axis=1);
  %731 = strided_slice(%707, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %732 = strided_slice(%731, begin=[2], end=[9223372036854775807], strides=[4], axes=[1]);
  %733 = clip(%732, a_min=-inff, a_max=4.13517f);
  %734 = strided_slice(%720, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %735 = exp(%733);
  %736 = expand_dims(%734, axis=1);
  %737 = multiply(%735, %736);
  %738 = add(%729, %730);
  %739 = multiply(%737, 0.5f);
  %740 = subtract(%738, %739);
  %741 = strided_slice(%707, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %742 = strided_slice(%714, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %743 = strided_slice(%714, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %744 = take(%742, 3, axis=1);
  %745 = take(%743, 1, axis=1);
  %746 = subtract(%744, %745);
  %747 = add(%746, 1f);
  %748 = strided_slice(%747, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %749 = strided_slice(%741, begin=[1], end=[9223372036854775807], strides=[4], axes=[1]);
  %750 = expand_dims(%748, axis=1);
  %751 = strided_slice(%714, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %752 = take(%751, 1, axis=1);
  %753 = multiply(0.5f, %747);
  %754 = add(%752, %753);
  %755 = strided_slice(%754, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %756 = multiply(%749, %750);
  %757 = expand_dims(%755, axis=1);
  %758 = strided_slice(%707, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %759 = strided_slice(%758, begin=[3], end=[9223372036854775807], strides=[4], axes=[1]);
  %760 = clip(%759, a_min=-inff, a_max=4.13517f);
  %761 = strided_slice(%747, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %762 = exp(%760);
  %763 = expand_dims(%761, axis=1);
  %764 = multiply(%762, %763);
  %765 = add(%756, %757);
  %766 = multiply(%764, 0.5f);
  %767 = subtract(%765, %766);
  %768 = multiply(%737, 0.5f);
  %769 = add(%738, %768);
  %770 = subtract(%769, 1f);
  %771 = multiply(%764, 0.5f);
  %772 = add(%765, %771);
  %773 = subtract(%772, 1f);
  %774 = expand_dims(%740, axis=2);
  %775 = expand_dims(%767, axis=2);
  %776 = expand_dims(%770, axis=2);
  %777 = expand_dims(%773, axis=2);
  %778 = (%774, %775, %776, %777);
  %779 = concatenate(%778, axis=2);
  %780 = reshape(%779, newshape=[147, 4]);
  %781 = reshape(%780, newshape=[1, -1, 4]);
  %782 = take(%781, 0, axis=0);
  %783 = strided_slice(%782, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %784 = strided_slice(%783, begin=[0], end=[9223372036854775807], strides=[2], axes=[1]);
  %785 = clip(%784, a_min=0f, a_max=1279f);
  %786 = strided_slice(%782, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %787 = strided_slice(%786, begin=[1], end=[9223372036854775807], strides=[2], axes=[1]);
  %788 = clip(%787, a_min=0f, a_max=1279f);
  %789 = expand_dims(%785, axis=2);
  %790 = expand_dims(%788, axis=2);
  %791 = (%789, %790);
  %792 = concatenate(%791, axis=2);
  %793 = reshape(%792, newshape=[-1, 4]);
  %794 = %697.0;
  %795 = take(%794, 0, axis=0);
  %796 = expand_dims(%795, axis=0);
  %797 = expand_dims(%793, axis=0);
  %798 = expand_dims(%796, axis=0);
  %799 = vision.all_class_non_max_suppression(%797, %798, 2000, 0.7f, 0f);
  %800 = %799.0;
  %801 = shape_of(%800, dtype="int32");
  %802 = cast_like(%801, meta[relay.Constant][213]);
  %803 = slice_like(%802, meta[relay.Constant][213], axes=None);
  %804 = add(meta[relay.Constant][213], %803);
  %805 = where(meta[relay.Constant][212], %804, meta[relay.Constant][213]);
  %806 = greater_equal(%805, %803);
  %807 = where(%806, %803, %805);
  %808 = %799.1;
  %809 = dyn.strided_slice(%800, %807, %808, meta[relay.Constant][214], begin=None, end=None, strides=None, axes=None);
  %810 = take(%809, meta[relay.Constant][215], axis=1);
  %811 = squeeze(%810, axis=[1]);
  %812 = shape_of(%811, dtype="int32");
  %813 = cast_like(%812, meta[relay.Constant][217]);
  %814 = slice_like(%813, meta[relay.Constant][217], axes=None);
  %815 = add(meta[relay.Constant][217], %814);
  %816 = where(meta[relay.Constant][216], %815, meta[relay.Constant][217]);
  %817 = greater_equal(%816, %814);
  %818 = shape_of(%811, dtype="int64");
  %819 = where(%817, %814, %816);
  %820 = scatter(%818, meta[relay.Constant][218], meta[relay.Constant][219]);
  %821 = dyn.strided_slice(%811, %819, %820, meta[relay.Constant][220], begin=None, end=None, strides=None, axes=None);
  %822 = cast(%821, dtype="int64");
  %823 = shape_of(%793, dtype="int64");
  %824 = take(%823, 0);
  %825 = less(%822, 0);
  %826 = add(%822, %824);
  %827 = where(%825, %826, %822);
  %828 = nn.max_pool2d(%682, pool_size=[1, 1], strides=[2, 2], padding=[0, 0, 0, 0]);
  %829 = nn.conv2d(%828, meta[relay.Constant][169], padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]);
  %830 = nn.bias_add(%829, meta[relay.Constant][170]);
  %831 = nn.relu(%830);
  %832 = nn.conv2d(%831, meta[relay.Constant][171], padding=[0, 0, 0, 0], channels=12, kernel_size=[1, 1]);
  %833 = nn.bias_add(%832, meta[relay.Constant][172]);
  %834 = reshape(%833, newshape=[1, -1, 4, 4, 4]);
  %835 = transpose(%834, axes=[0, 3, 4, 1, 2]);
  %836 = nn.conv2d(%831, meta[relay.Constant][173], padding=[0, 0, 0, 0], channels=3, kernel_size=[1, 1]);
  %837 = nn.bias_add(%836, meta[relay.Constant][174]);
  %838 = reshape(%837, newshape=[1, -1, 1, 4, 4]);
  %839 = transpose(%838, axes=[0, 3, 4, 1, 2]);
  %840 = reshape(%839, newshape=[1, -1, 1]);
  %841 = reshape(%840, newshape=[1, -1]);
  %842 = sigmoid(%841);
  %843 = topk(%842, k=48, axis=1, dtype="int64");
  %844 = %843.1;
  %845 = squeeze(%844, axis=[0]);
  %846 = reshape(%835, newshape=[1, -1, 4]);
  %847 = shape_of(%846, dtype="int64");
  %848 = take(%847, 1);
  %849 = less(%845, 0);
  %850 = add(%845, %848);
  %851 = where(%849, %850, %845);
  %852 = take(%846, %851, axis=1);
  %853 = reshape(%852, newshape=[-1, 4]);
  %854 = strided_slice(%853, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %855 = less(%845, 0);
  %856 = add(%845, 48);
  %857 = where(%855, %856, %845);
  %858 = take(meta[relay.Constant][221], %857, axis=1);
  %859 = reshape(%858, newshape=[-1, 4]);
  %860 = cast(%859, dtype="float32");
  %861 = strided_slice(%860, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %862 = strided_slice(%860, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %863 = take(%861, 2, axis=1);
  %864 = take(%862, 0, axis=1);
  %865 = subtract(%863, %864);
  %866 = add(%865, 1f);
  %867 = strided_slice(%866, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %868 = strided_slice(%854, begin=[0], end=[9223372036854775807], strides=[4], axes=[1]);
  %869 = expand_dims(%867, axis=1);
  %870 = strided_slice(%860, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %871 = take(%870, 0, axis=1);
  %872 = multiply(0.5f, %866);
  %873 = add(%871, %872);
  %874 = strided_slice(%873, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %875 = multiply(%868, %869);
  %876 = expand_dims(%874, axis=1);
  %877 = strided_slice(%853, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %878 = strided_slice(%877, begin=[2], end=[9223372036854775807], strides=[4], axes=[1]);
  %879 = clip(%878, a_min=-inff, a_max=4.13517f);
  %880 = strided_slice(%866, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %881 = exp(%879);
  %882 = expand_dims(%880, axis=1);
  %883 = multiply(%881, %882);
  %884 = add(%875, %876);
  %885 = multiply(%883, 0.5f);
  %886 = subtract(%884, %885);
  %887 = strided_slice(%853, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %888 = strided_slice(%860, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %889 = strided_slice(%860, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %890 = take(%888, 3, axis=1);
  %891 = take(%889, 1, axis=1);
  %892 = subtract(%890, %891);
  %893 = add(%892, 1f);
  %894 = strided_slice(%893, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %895 = strided_slice(%887, begin=[1], end=[9223372036854775807], strides=[4], axes=[1]);
  %896 = expand_dims(%894, axis=1);
  %897 = strided_slice(%860, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %898 = take(%897, 1, axis=1);
  %899 = multiply(0.5f, %893);
  %900 = add(%898, %899);
  %901 = strided_slice(%900, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %902 = multiply(%895, %896);
  %903 = expand_dims(%901, axis=1);
  %904 = strided_slice(%853, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %905 = strided_slice(%904, begin=[3], end=[9223372036854775807], strides=[4], axes=[1]);
  %906 = clip(%905, a_min=-inff, a_max=4.13517f);
  %907 = strided_slice(%893, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %908 = exp(%906);
  %909 = expand_dims(%907, axis=1);
  %910 = multiply(%908, %909);
  %911 = add(%902, %903);
  %912 = multiply(%910, 0.5f);
  %913 = subtract(%911, %912);
  %914 = multiply(%883, 0.5f);
  %915 = add(%884, %914);
  %916 = subtract(%915, 1f);
  %917 = multiply(%910, 0.5f);
  %918 = add(%911, %917);
  %919 = subtract(%918, 1f);
  %920 = expand_dims(%886, axis=2);
  %921 = expand_dims(%913, axis=2);
  %922 = expand_dims(%916, axis=2);
  %923 = expand_dims(%919, axis=2);
  %924 = (%920, %921, %922, %923);
  %925 = concatenate(%924, axis=2);
  %926 = reshape(%925, newshape=[48, 4]);
  %927 = reshape(%926, newshape=[1, -1, 4]);
  %928 = take(%927, 0, axis=0);
  %929 = strided_slice(%928, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %930 = strided_slice(%929, begin=[0], end=[9223372036854775807], strides=[2], axes=[1]);
  %931 = clip(%930, a_min=0f, a_max=1279f);
  %932 = strided_slice(%928, begin=[0], end=[9223372036854775807], strides=[1], axes=[0]);
  %933 = strided_slice(%932, begin=[1], end=[9223372036854775807], strides=[2], axes=[1]);
  %934 = clip(%933, a_min=0f, a_max=1279f);
  %935 = expand_dims(%931, axis=2);
  %936 = expand_dims(%934, axis=2);
  %937 = (%935, %936);
  %938 = concatenate(%937, axis=2);
  %939 = reshape(%938, newshape=[-1, 4]);
  %940 = %843.0;
  %941 = take(%940, 0, axis=0);
  %942 = expand_dims(%941, axis=0);
  %943 = expand_dims(%939, axis=0);
  %944 = expand_dims(%942, axis=0);
  %945 = vision.all_class_non_max_suppression(%943, %944, 2000, 0.7f, 0f);
  %946 = %945.0;
  %947 = shape_of(%946, dtype="int32");
  %948 = cast_like(%947, meta[relay.Constant][223]);
  %949 = slice_like(%948, meta[relay.Constant][223], axes=None);
  %950 = add(meta[relay.Constant][223], %949);
  %951 = where(meta[relay.Constant][222], %950, meta[relay.Constant][223]);
  %952 = greater_equal(%951, %949);
  %953 = where(%952, %949, %951);
  %954 = %945.1;
  %955 = dyn.strided_slice(%946, %953, %954, meta[relay.Constant][224], begin=None, end=None, strides=None, axes=None);
  %956 = take(%955, meta[relay.Constant][225], axis=1);
  %957 = squeeze(%956, axis=[1]);
  %958 = shape_of(%957, dtype="int32");
  %959 = cast_like(%958, meta[relay.Constant][227]);
  %960 = slice_like(%959, meta[relay.Constant][227], axes=None);
  %961 = add(meta[relay.Constant][227], %960);
  %962 = where(meta[relay.Constant][226], %961, meta[relay.Constant][227]);
  %963 = greater_equal(%962, %960);
  %964 = shape_of(%957, dtype="int64");
  %965 = where(%963, %960, %962);
  %966 = scatter(%964, meta[relay.Constant][228], meta[relay.Constant][229]);
  %967 = dyn.strided_slice(%957, %965, %966, meta[relay.Constant][230], begin=None, end=None, strides=None, axes=None);
  %968 = cast(%967, dtype="int64");
  %969 = shape_of(%939, dtype="int64");
  %970 = take(%969, 0);
  %971 = less(%968, 0);
  %972 = add(%968, %970);
  %973 = where(%971, %972, %968);
  %974 = take(%352, %386, axis=0);
  %975 = take(%499, %533, axis=0);
  %976 = take(%646, %680, axis=0);
  %977 = take(%793, %827, axis=0);
  %978 = take(%939, %973, axis=0);
  %979 = (%974, %975, %976, %977, %978);
  %980 = cast(%381, dtype="int64");
  %981 = shape_of(%354, dtype="int64");
  %982 = take(%981, 0);
  %983 = less(%980, 0);
