def @main(%conv2/3x3_reduce_w_0: Tensor[(64, 64, 1, 1), float32], %call_4: Tensor[(1, 64, 56, 56), float32] {
  nn.conv2d(%4, %conv2/3x3_reduce_w_0, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 56, 56), float32] */;
}