def @main(%onnx::Conv_667: Tensor[(112), float32], %onnx::Conv_729: Tensor[(48, 832, 1, 1), float32], %onnx::Conv_684: Tensor[(256, 528, 1, 1), float32], %onnx::Conv_735: Tensor[(128, 832, 1, 1), float32], %onnx::Conv_580: Tensor[(96), float32], %onnx::Conv_624: Tensor[(48, 16, 3, 3), float32], %onnx::Conv_678: Tensor[(64, 32, 3, 3), float32], %onnx::Conv_699: Tensor[(128, 528, 1, 1), float32], %onnx::Conv_652: Tensor[(128), float32], %onnx::Conv_646: Tensor[(64), float32], %call_21: Tensor[(15, 192, 56, 56), float32], %onnx::Conv_598: Tensor[(128), float32], %onnx::Conv_613: Tensor[(192), float32], %onnx::Conv_663: Tensor[(64, 512, 1, 1), float32], %onnx::Conv_709: Tensor[(320), float32], %onnx::Conv_640: Tensor[(24), float32], %onnx::Conv_708: Tensor[(320, 160, 3, 3), float32], %onnx::Conv_696: Tensor[(128, 32, 3, 3), float32], %onnx::Conv_601: Tensor[(192), float32], %onnx::Conv_609: Tensor[(64, 256, 1, 1), float32], %onnx::Conv_705: Tensor[(160, 832, 1, 1), float32], %onnx::Conv_585: Tensor[(16, 192, 1, 1), float32], %onnx::Conv_568: Tensor[(64), float32], %onnx::Conv_591: Tensor[(32, 192, 1, 1), float32], %onnx::Conv_736: Tensor[(128), float32]) -> Tensor[(15, 1000), float32], %onnx::Conv_715: Tensor[(128), float32], %onnx::Conv_657: Tensor[(24, 512, 1, 1), float32], %onnx::Conv_733: Tensor[(128), float32], %onnx::Conv_723: Tensor[(192, 832, 1, 1), float32], %onnx::Conv_697: Tensor[(128), float32], %onnx::Conv_628: Tensor[(64), float32], %onnx::Conv_694: Tensor[(32), float32], %onnx::Conv_655: Tensor[(256), float32], %onnx::Conv_604: Tensor[(32), float32], %onnx::Conv_721: Tensor[(384), float32], %onnx::Conv_594: Tensor[(128, 256, 1, 1), float32], %onnx::Conv_595: Tensor[(128), float32], %onnx::Conv_675: Tensor[(32, 512, 1, 1), float32], %onnx::Conv_592: Tensor[(32), float32], %onnx::Conv_651: Tensor[(128, 512, 1, 1), float32], %onnx::Conv_583: Tensor[(128), float32], %onnx::Conv_612: Tensor[(192, 480, 1, 1), float32], %onnx::Conv_588: Tensor[(32, 16, 3, 3), float32], %onnx::Conv_606: Tensor[(96, 32, 3, 3), float32], %onnx::Conv_679: Tensor[(64), float32], %onnx::Conv_724: Tensor[(192), float32], %onnx::Conv_654: Tensor[(256, 128, 3, 3), float32], %onnx::Conv_615: Tensor[(96, 480, 1, 1), float32], %onnx::Conv_630: Tensor[(160, 512, 1, 1), float32], %onnx::Conv_574: Tensor[(192), float32], %onnx::Conv_645: Tensor[(64, 512, 1, 1), float32], %onnx::Conv_616: Tensor[(96), float32], %onnx::Conv_633: Tensor[(112, 512, 1, 1), float32], %onnx::Conv_649: Tensor[(128), float32], %onnx::Conv_661: Tensor[(64), float32], %onnx::Conv_681: Tensor[(64, 512, 1, 1), float32], %onnx::Conv_600: Tensor[(192, 128, 3, 3), float32], %onnx::Conv_687: Tensor[(160, 528, 1, 1), float32], %onnx::Conv_622: Tensor[(16), float32], %onnx::Conv_627: Tensor[(64, 480, 1, 1), float32], %onnx::Conv_711: Tensor[(32, 832, 1, 1), float32], %onnx::Conv_714: Tensor[(128, 32, 3, 3), float32], %onnx::Conv_570: Tensor[(64, 64, 1, 1), float32], %onnx::Conv_618: Tensor[(208, 96, 3, 3), float32], %onnx::Conv_720: Tensor[(384, 832, 1, 1), float32], %onnx::Conv_658: Tensor[(24), float32], %onnx::Conv_621: Tensor[(16, 480, 1, 1), float32], %onnx::Conv_726: Tensor[(384, 192, 3, 3), float32], %onnx::Conv_685: Tensor[(256), float32], %onnx::Conv_693: Tensor[(32, 528, 1, 1), float32], %onnx::Conv_636: Tensor[(224, 112, 3, 3), float32], %onnx::Conv_700: Tensor[(128), float32], %onnx::Conv_669: Tensor[(144, 512, 1, 1), float32], %onnx::Conv_703: Tensor[(256), float32], %onnx::Conv_571: Tensor[(64), float32], %onnx::Conv_712: Tensor[(32), float32], %onnx::Conv_576: Tensor[(64, 192, 1, 1), float32], %onnx::Conv_642: Tensor[(64, 24, 3, 3), float32], %onnx::Conv_577: Tensor[(64), float32], %onnx::Conv_702: Tensor[(256, 832, 1, 1), float32], %onnx::Conv_666: Tensor[(112, 512, 1, 1), float32], %onnx::Conv_579: Tensor[(96, 192, 1, 1), float32], %onnx::Conv_639: Tensor[(24, 512, 1, 1), float32], %onnx::Conv_670: Tensor[(144), float32], %onnx::Conv_567: Tensor[(64, 3, 7, 7), float32], %onnx::Conv_691: Tensor[(320), float32], %onnx::Conv_673: Tensor[(288), float32], %onnx::Conv_573: Tensor[(192, 64, 3, 3), float32], %onnx::Conv_664: Tensor[(64), float32], %onnx::Conv_688: Tensor[(160), float32], %onnx::Conv_582: Tensor[(128, 96, 3, 3), float32], %onnx::Conv_717: Tensor[(128, 832, 1, 1), float32], %onnx::Conv_690: Tensor[(320, 160, 3, 3), float32], %onnx::Conv_619: Tensor[(208), float32], %onnx::Conv_637: Tensor[(224), float32], %onnx::Conv_589: Tensor[(32), float32], %onnx::Conv_597: Tensor[(128, 256, 1, 1), float32], %onnx::Conv_610: Tensor[(64), float32], %onnx::Conv_676: Tensor[(32), float32], %onnx::Conv_732: Tensor[(128, 48, 3, 3), float32], %onnx::Conv_607: Tensor[(96), float32], %onnx::Conv_682: Tensor[(64), float32], %onnx::Conv_718: Tensor[(128), float32], %onnx::Conv_643: Tensor[(64), float32], %onnx::Conv_648: Tensor[(128, 512, 1, 1), float32], %onnx::Conv_730: Tensor[(48), float32], %onnx::Conv_706: Tensor[(160), float32], %onnx::Conv_660: Tensor[(64, 24, 3, 3), float32], %onnx::Conv_586: Tensor[(16), float32], %onnx::Conv_603: Tensor[(32, 256, 1, 1), float32], %onnx::Conv_625: Tensor[(48), float32], %onnx::Conv_672: Tensor[(288, 144, 3, 3), float32], %onnx::Conv_634: Tensor[(112), float32], %onnx::Conv_631: Tensor[(160), float32], %onnx::Conv_727: Tensor[(384), float32] {
  nn.bias_add(%21, %onnx::Conv_574) /* ty=Tensor[(15, 192, 56, 56), float32] */;
}