def @main(%data_0: Tensor[(1, 3, 224, 224), float32], %conv1/7x7_s2_w_0: Tensor[(64, 3, 7, 7), float32], %conv1/7x7_s2_b_0: Tensor[(64), float32] {
  %0 = nn.conv2d(%data_0, %conv1/7x7_s2_w_0, strides=[2, 2], padding=[3, 3, 3, 3], channels=64, kernel_size=[7, 7]) /* ty=Tensor[(1, 64, 112, 112), float32] */;
  nn.bias_add(%0, %conv1/7x7_s2_b_0) /* ty=Tensor[(1, 64, 112, 112), float32] */;
}