def @main(%onnx::Conv_603: Tensor[(256), float32], %onnx::Conv_621: Tensor[(256), float32], %onnx::Conv_636: Tensor[(2048), float32], %onnx::Conv_512: Tensor[(64, 256, 1, 1), float32], %onnx::Conv_609: Tensor[(256), float32], %onnx::Conv_498: Tensor[(64), float32], %onnx::Conv_527: Tensor[(256, 64, 1, 1), float32], %onnx::Conv_540: Tensor[(512), float32], %onnx::Conv_623: Tensor[(1024, 256, 1, 1), float32], %onnx::Conv_531: Tensor[(128), float32], %onnx::Conv_497: Tensor[(64, 3, 7, 7), float32], %onnx::Conv_525: Tensor[(64), float32], %onnx::Conv_614: Tensor[(1024, 256, 1, 1), float32], %onnx::Conv_573: Tensor[(256), float32], %onnx::Conv_555: Tensor[(128), float32], %onnx::Conv_572: Tensor[(256, 256, 3, 3), float32], %onnx::Conv_617: Tensor[(256, 1024, 1, 1), float32], %onnx::Conv_647: Tensor[(512, 2048, 1, 1), float32], %onnx::Conv_530: Tensor[(128, 256, 1, 1), float32], %onnx::Conv_612: Tensor[(256), float32], %onnx::Conv_653: Tensor[(2048, 512, 1, 1), float32], %onnx::Conv_501: Tensor[(64), float32], %onnx::Conv_579: Tensor[(1024), float32], %onnx::Conv_587: Tensor[(1024, 256, 1, 1), float32], %onnx::Conv_513: Tensor[(64), float32], %onnx::Conv_564: Tensor[(128), float32], %onnx::Conv_509: Tensor[(256, 64, 1, 1), float32], %onnx::Conv_648: Tensor[(512), float32], %onnx::Conv_605: Tensor[(1024, 256, 1, 1), float32], %onnx::Conv_543: Tensor[(128), float32], %onnx::Conv_561: Tensor[(128), float32], %onnx::Conv_624: Tensor[(1024), float32], %onnx::Conv_596: Tensor[(1024, 256, 1, 1), float32], %onnx::Conv_627: Tensor[(512), float32], %onnx::Conv_645: Tensor[(2048), float32], %onnx::Conv_569: Tensor[(256, 512, 1, 1), float32], %onnx::Conv_533: Tensor[(128, 128, 3, 3), float32], %onnx::Conv_620: Tensor[(256, 256, 3, 3), float32], %onnx::Conv_504: Tensor[(64), float32], %onnx::Conv_641: Tensor[(512, 512, 3, 3), float32], %onnx::Conv_630: Tensor[(512), float32], %onnx::Conv_570: Tensor[(256), float32], %onnx::Conv_639: Tensor[(512), float32], %onnx::Conv_588: Tensor[(1024), float32], %onnx::Conv_549: Tensor[(512), float32], %onnx::Conv_642: Tensor[(512), float32], %onnx::Conv_507: Tensor[(256), float32], %onnx::Conv_554: Tensor[(128, 128, 3, 3), float32], %onnx::Conv_567: Tensor[(512), float32], %onnx::Conv_557: Tensor[(512, 128, 1, 1), float32], %onnx::Conv_591: Tensor[(256), float32], %onnx::Conv_563: Tensor[(128, 128, 3, 3), float32], %onnx::Conv_524: Tensor[(64, 64, 3, 3), float32], %onnx::Conv_566: Tensor[(512, 128, 1, 1), float32], %onnx::Conv_600: Tensor[(256), float32], %onnx::Conv_650: Tensor[(512, 512, 3, 3), float32], %onnx::Conv_635: Tensor[(2048, 1024, 1, 1), float32], %onnx::Conv_519: Tensor[(256), float32], %onnx::Conv_506: Tensor[(256, 64, 1, 1), float32], %onnx::Conv_536: Tensor[(512, 128, 1, 1), float32], %onnx::Conv_594: Tensor[(256), float32], %onnx::Conv_638: Tensor[(512, 2048, 1, 1), float32], %onnx::Conv_633: Tensor[(2048), float32], %onnx::Conv_500: Tensor[(64, 64, 1, 1), float32], %onnx::Conv_537: Tensor[(512), float32], %onnx::Conv_615: Tensor[(1024), float32], %onnx::Conv_575: Tensor[(1024, 256, 1, 1), float32], %onnx::Conv_552: Tensor[(128), float32], %onnx::Conv_581: Tensor[(256, 1024, 1, 1), float32], %onnx::Conv_606: Tensor[(1024), float32], %onnx::Conv_618: Tensor[(256), float32], %onnx::Conv_515: Tensor[(64, 64, 3, 3), float32], %onnx::Conv_585: Tensor[(256), float32], %onnx::Conv_546: Tensor[(128), float32], %onnx::Conv_534: Tensor[(128), float32], %onnx::Conv_560: Tensor[(128, 512, 1, 1), float32], %onnx::Conv_503: Tensor[(64, 64, 3, 3), float32], %onnx::Conv_608: Tensor[(256, 1024, 1, 1), float32], %onnx::Conv_528: Tensor[(256), float32], %onnx::Conv_518: Tensor[(256, 64, 1, 1), float32], %onnx::Conv_632: Tensor[(2048, 512, 1, 1), float32], %onnx::Conv_539: Tensor[(512, 256, 1, 1), float32], %onnx::Conv_597: Tensor[(1024), float32], %onnx::Conv_548: Tensor[(512, 128, 1, 1), float32], %onnx::Conv_651: Tensor[(512), float32], %onnx::Conv_599: Tensor[(256, 1024, 1, 1), float32], %onnx::Conv_578: Tensor[(1024, 512, 1, 1), float32], %onnx::Conv_542: Tensor[(128, 512, 1, 1), float32], %onnx::Conv_626: Tensor[(512, 1024, 1, 1), float32], %onnx::Conv_576: Tensor[(1024), float32], %onnx::Conv_611: Tensor[(256, 256, 3, 3), float32], %onnx::Conv_545: Tensor[(128, 128, 3, 3), float32], %onnx::Conv_510: Tensor[(256), float32], %onnx::Conv_629: Tensor[(512, 512, 3, 3), float32], %onnx::Conv_516: Tensor[(64), float32], %onnx::Conv_593: Tensor[(256, 256, 3, 3), float32], %onnx::Conv_602: Tensor[(256, 256, 3, 3), float32], %onnx::Conv_654: Tensor[(2048), float32]) -> Tensor[(15, 1000), float32], %onnx::Conv_644: Tensor[(2048, 512, 1, 1), float32], %onnx::Conv_584: Tensor[(256, 256, 3, 3), float32], %onnx::Conv_558: Tensor[(512), float32], %call_0: Tensor[(15, 64, 112, 112), float32], %onnx::Conv_590: Tensor[(256, 1024, 1, 1), float32], %onnx::Conv_551: Tensor[(128, 512, 1, 1), float32], %onnx::Conv_582: Tensor[(256), float32], %onnx::Conv_522: Tensor[(64), float32], %onnx::Conv_521: Tensor[(64, 256, 1, 1), float32] {
  nn.bias_add(%0, %onnx::Conv_498) /* ty=Tensor[(15, 64, 112, 112), float32] */;
}