def @main(%call_82: Tensor[(15, 512, 13, 13), float32], %features.12.squeeze.weight: Tensor[(64, 512, 1, 1), float32] {
  nn.conv2d(%82, %features.12.squeeze.weight, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(15, 64, 13, 13), float32] */;
}