def @main(%call_93: Tensor[(15, 512, 13, 13), float32], %classifier.1.weight: Tensor[(1000, 512, 1, 1), float32] {
  nn.conv2d(%93, %classifier.1.weight, padding=[0, 0, 0, 0], channels=1000, kernel_size=[1, 1]) /* ty=Tensor[(15, 1000, 13, 13), float32] */;
}