def @main(%call_25: Tensor[(15, 128, 54, 54), float32], %features.5.squeeze.weight: Tensor[(32, 128, 1, 1), float32] {
  nn.conv2d(%25, %features.5.squeeze.weight, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(15, 32, 54, 54), float32] */;
}