def @main(%call_37: Tensor[(15, 256, 27, 27), float32], %features.7.squeeze.weight: Tensor[(32, 256, 1, 1), float32] {
  nn.conv2d(%37, %features.7.squeeze.weight, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(15, 32, 27, 27), float32] */;
}