def @main(%features.0.weight: Tensor[(96, 3, 7, 7), float32], %data_0: Tensor[(15, 3, 224, 224), float32] {
  nn.conv2d(%data_0, %features.0.weight, strides=[2, 2], padding=[0, 0, 0, 0], channels=96, kernel_size=[7, 7]) /* ty=Tensor[(15, 96, 109, 109), float32] */;
}