def @main(%fire7/squeeze1x1_w_0: Tensor[(48, 384, 1, 1), float32], %call_60: Tensor[(1, 384, 13, 13), float32] {
  nn.conv2d(%60, %fire7/squeeze1x1_w_0, padding=[0, 0, 0, 0], channels=48, kernel_size=[1, 1]) /* ty=Tensor[(1, 48, 13, 13), float32] */;
}