def @main(%conv1_b_0: Tensor[(64), float32], %data_0: Tensor[(1, 3, 224, 224), float32]), %conv1_w_0: Tensor[(64, 3, 3, 3), float32] {
  %0 = nn.conv2d(%data_0, %conv1_w_0, strides=[2, 2], padding=[0, 0, 0, 0], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(1, 64, 111, 111), float32] */;
  nn.bias_add(%0, %conv1_b_0) /* ty=Tensor[(1, 64, 111, 111), float32] */;
}