def @main(%call_3: Tensor[(15, 96, 54, 54), float32], %features.3.squeeze.weight: Tensor[(16, 96, 1, 1), float32] {
  nn.conv2d(%3, %features.3.squeeze.weight, padding=[0, 0, 0, 0], channels=16, kernel_size=[1, 1]) /* ty=Tensor[(15, 16, 54, 54), float32] */;
}