def @main(%call_82: Tensor[(1, 512, 13, 13), float32], %fire9/squeeze1x1_w_0: Tensor[(64, 512, 1, 1), float32] {
  nn.conv2d(%82, %fire9/squeeze1x1_w_0, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 13, 13), float32] */;
}