def @main(%fire4/squeeze1x1_w_0: Tensor[(32, 128, 1, 1), float32], %call_26: Tensor[(1, 128, 27, 27), float32] {
  nn.conv2d(%26, %fire4/squeeze1x1_w_0, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(1, 32, 27, 27), float32] */;
}