def @main(%call_71: Tensor[(1, 384, 13, 13), float32], %fire8/squeeze1x1_w_0: Tensor[(64, 384, 1, 1), float32] {
  nn.conv2d(%71, %fire8/squeeze1x1_w_0, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1, 64, 13, 13), float32] */;
}