def @main(%fire2/squeeze1x1_w_0: Tensor[(16, 64, 1, 1), float32], %call_3: Tensor[(1, 64, 55, 55), float32] {
  nn.conv2d(%3, %fire2/squeeze1x1_w_0, padding=[0, 0, 0, 0], channels=16, kernel_size=[1, 1]) /* ty=Tensor[(1, 16, 55, 55), float32] */;
}