def @main(%call_48: Tensor[(15, 256, 27, 27), float32], %features.8.squeeze.weight: Tensor[(48, 256, 1, 1), float32] {
  nn.conv2d(%48, %features.8.squeeze.weight, padding=[0, 0, 0, 0], channels=48, kernel_size=[1, 1]) /* ty=Tensor[(15, 48, 27, 27), float32] */;
}