def @main(%call_94: (Tensor[(1, 512, 13, 13), float32], Tensor[(1, 512, 13, 13), float32]), %conv10_w_0: Tensor[(1000, 512, 1, 1), float32] {
  %95 = %94.0;
  nn.conv2d(%95, %conv10_w_0, padding=[0, 0, 0, 0], channels=1000, kernel_size=[1, 1]) /* ty=Tensor[(1, 1000, 13, 13), float32] */;
}