def @main(%call_70: Tensor[(15, 384, 27, 27), float32], %features.10.squeeze.weight: Tensor[(64, 384, 1, 1), float32] {
  nn.conv2d(%70, %features.10.squeeze.weight, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(15, 64, 27, 27), float32] */;
}