def @main(%features.4.squeeze.weight: Tensor[(16, 128, 1, 1), float32], %call_14: Tensor[(15, 128, 54, 54), float32] {
  nn.conv2d(%14, %features.4.squeeze.weight, padding=[0, 0, 0, 0], channels=16, kernel_size=[1, 1]) /* ty=Tensor[(15, 16, 54, 54), float32] */;
}