def @main(%call_14: Tensor[(1, 128, 55, 55), float32], %fire3/squeeze1x1_w_0: Tensor[(16, 128, 1, 1), float32] {
  nn.conv2d(%14, %fire3/squeeze1x1_w_0, padding=[0, 0, 0, 0], channels=16, kernel_size=[1, 1]) /* ty=Tensor[(1, 16, 55, 55), float32] */;
}