def @main(%call_59: Tensor[(15, 384, 27, 27), float32], %features.9.squeeze.weight: Tensor[(48, 384, 1, 1), float32] {
  nn.conv2d(%59, %features.9.squeeze.weight, padding=[0, 0, 0, 0], channels=48, kernel_size=[1, 1]) /* ty=Tensor[(15, 48, 27, 27), float32] */;
}