def @main(%data_0: Tensor[(15, 3, 224, 224), float32], %fc.weight: Tensor[(1000, 1024), float32], %fc.bias: Tensor[(1000), float32], %onnx::Conv_567: Tensor[(64, 3, 7, 7), float32], %onnx::Conv_568: Tensor[(64), float32], %onnx::Conv_570: Tensor[(64, 64, 1, 1), float32], %onnx::Conv_571: Tensor[(64), float32], %onnx::Conv_573: Tensor[(192, 64, 3, 3), float32], %onnx::Conv_574: Tensor[(192), float32], %onnx::Conv_576: Tensor[(64, 192, 1, 1), float32], %onnx::Conv_577: Tensor[(64), float32], %onnx::Conv_579: Tensor[(96, 192, 1, 1), float32], %onnx::Conv_580: Tensor[(96), float32], %onnx::Conv_582: Tensor[(128, 96, 3, 3), float32], %onnx::Conv_583: Tensor[(128), float32], %onnx::Conv_585: Tensor[(16, 192, 1, 1), float32], %onnx::Conv_586: Tensor[(16), float32], %onnx::Conv_588: Tensor[(32, 16, 3, 3), float32], %onnx::Conv_589: Tensor[(32), float32], %onnx::Conv_591: Tensor[(32, 192, 1, 1), float32], %onnx::Conv_592: Tensor[(32), float32], %onnx::Conv_594: Tensor[(128, 256, 1, 1), float32], %onnx::Conv_595: Tensor[(128), float32], %onnx::Conv_597: Tensor[(128, 256, 1, 1), float32], %onnx::Conv_598: Tensor[(128), float32], %onnx::Conv_600: Tensor[(192, 128, 3, 3), float32], %onnx::Conv_601: Tensor[(192), float32], %onnx::Conv_603: Tensor[(32, 256, 1, 1), float32], %onnx::Conv_604: Tensor[(32), float32], %onnx::Conv_606: Tensor[(96, 32, 3, 3), float32], %onnx::Conv_607: Tensor[(96), float32], %onnx::Conv_609: Tensor[(64, 256, 1, 1), float32], %onnx::Conv_610: Tensor[(64), float32], %onnx::Conv_612: Tensor[(192, 480, 1, 1), float32], %onnx::Conv_613: Tensor[(192), float32], %onnx::Conv_615: Tensor[(96, 480, 1, 1), float32], %onnx::Conv_616: Tensor[(96), float32], %onnx::Conv_618: Tensor[(208, 96, 3, 3), float32], %onnx::Conv_619: Tensor[(208), float32], %onnx::Conv_621: Tensor[(16, 480, 1, 1), float32], %onnx::Conv_622: Tensor[(16), float32], %onnx::Conv_624: Tensor[(48, 16, 3, 3), float32], %onnx::Conv_625: Tensor[(48), float32], %onnx::Conv_627: Tensor[(64, 480, 1, 1), float32], %onnx::Conv_628: Tensor[(64), float32], %onnx::Conv_630: Tensor[(160, 512, 1, 1), float32], %onnx::Conv_631: Tensor[(160), float32], %onnx::Conv_633: Tensor[(112, 512, 1, 1), float32], %onnx::Conv_634: Tensor[(112), float32], %onnx::Conv_636: Tensor[(224, 112, 3, 3), float32], %onnx::Conv_637: Tensor[(224), float32], %onnx::Conv_639: Tensor[(24, 512, 1, 1), float32], %onnx::Conv_640: Tensor[(24), float32], %onnx::Conv_642: Tensor[(64, 24, 3, 3), float32], %onnx::Conv_643: Tensor[(64), float32], %onnx::Conv_645: Tensor[(64, 512, 1, 1), float32], %onnx::Conv_646: Tensor[(64), float32], %onnx::Conv_648: Tensor[(128, 512, 1, 1), float32], %onnx::Conv_649: Tensor[(128), float32], %onnx::Conv_651: Tensor[(128, 512, 1, 1), float32], %onnx::Conv_652: Tensor[(128), float32], %onnx::Conv_654: Tensor[(256, 128, 3, 3), float32], %onnx::Conv_655: Tensor[(256), float32], %onnx::Conv_657: Tensor[(24, 512, 1, 1), float32], %onnx::Conv_658: Tensor[(24), float32], %onnx::Conv_660: Tensor[(64, 24, 3, 3), float32], %onnx::Conv_661: Tensor[(64), float32], %onnx::Conv_663: Tensor[(64, 512, 1, 1), float32], %onnx::Conv_664: Tensor[(64), float32], %onnx::Conv_666: Tensor[(112, 512, 1, 1), float32], %onnx::Conv_667: Tensor[(112), float32], %onnx::Conv_669: Tensor[(144, 512, 1, 1), float32], %onnx::Conv_670: Tensor[(144), float32], %onnx::Conv_672: Tensor[(288, 144, 3, 3), float32], %onnx::Conv_673: Tensor[(288), float32], %onnx::Conv_675: Tensor[(32, 512, 1, 1), float32], %onnx::Conv_676: Tensor[(32), float32], %onnx::Conv_678: Tensor[(64, 32, 3, 3), float32], %onnx::Conv_679: Tensor[(64), float32], %onnx::Conv_681: Tensor[(64, 512, 1, 1), float32], %onnx::Conv_682: Tensor[(64), float32], %onnx::Conv_684: Tensor[(256, 528, 1, 1), float32], %onnx::Conv_685: Tensor[(256), float32], %onnx::Conv_687: Tensor[(160, 528, 1, 1), float32], %onnx::Conv_688: Tensor[(160), float32], %onnx::Conv_690: Tensor[(320, 160, 3, 3), float32], %onnx::Conv_691: Tensor[(320), float32], %onnx::Conv_693: Tensor[(32, 528, 1, 1), float32], %onnx::Conv_694: Tensor[(32), float32], %onnx::Conv_696: Tensor[(128, 32, 3, 3), float32], %onnx::Conv_697: Tensor[(128), float32], %onnx::Conv_699: Tensor[(128, 528, 1, 1), float32], %onnx::Conv_700: Tensor[(128), float32], %onnx::Conv_702: Tensor[(256, 832, 1, 1), float32], %onnx::Conv_703: Tensor[(256), float32], %onnx::Conv_705: Tensor[(160, 832, 1, 1), float32], %onnx::Conv_706: Tensor[(160), float32], %onnx::Conv_708: Tensor[(320, 160, 3, 3), float32], %onnx::Conv_709: Tensor[(320), float32], %onnx::Conv_711: Tensor[(32, 832, 1, 1), float32], %onnx::Conv_712: Tensor[(32), float32], %onnx::Conv_714: Tensor[(128, 32, 3, 3), float32], %onnx::Conv_715: Tensor[(128), float32], %onnx::Conv_717: Tensor[(128, 832, 1, 1), float32], %onnx::Conv_718: Tensor[(128), float32], %onnx::Conv_720: Tensor[(384, 832, 1, 1), float32], %onnx::Conv_721: Tensor[(384), float32], %onnx::Conv_723: Tensor[(192, 832, 1, 1), float32], %onnx::Conv_724: Tensor[(192), float32], %onnx::Conv_726: Tensor[(384, 192, 3, 3), float32], %onnx::Conv_727: Tensor[(384), float32], %onnx::Conv_729: Tensor[(48, 832, 1, 1), float32], %onnx::Conv_730: Tensor[(48), float32], %onnx::Conv_732: Tensor[(128, 48, 3, 3), float32], %onnx::Conv_733: Tensor[(128), float32], %onnx::Conv_735: Tensor[(128, 832, 1, 1), float32], %onnx::Conv_736: Tensor[(128), float32]) -> Tensor[(15, 1000), float32] {
  %0 = take(%data_0, 0 /* ty=int64 */, axis=1) /* ty=Tensor[(15, 224, 224), float32] */;
  %1 = expand_dims(%0, axis=1) /* ty=Tensor[(15, 1, 224, 224), float32] */;
  %2 = multiply(%1, 0.458f /* ty=float32 */) /* ty=Tensor[(15, 1, 224, 224), float32] */;
  %3 = take(%data_0, 1 /* ty=int64 */, axis=1) /* ty=Tensor[(15, 224, 224), float32] */;
  %4 = expand_dims(%3, axis=1) /* ty=Tensor[(15, 1, 224, 224), float32] */;
  %5 = multiply(%4, 0.448f /* ty=float32 */) /* ty=Tensor[(15, 1, 224, 224), float32] */;
  %6 = take(%data_0, 2 /* ty=int64 */, axis=1) /* ty=Tensor[(15, 224, 224), float32] */;
  %7 = expand_dims(%6, axis=1) /* ty=Tensor[(15, 1, 224, 224), float32] */;
  %8 = multiply(%7, 0.45f /* ty=float32 */) /* ty=Tensor[(15, 1, 224, 224), float32] */;
  %9 = add(%2, -0.03f /* ty=float32 */) /* ty=Tensor[(15, 1, 224, 224), float32] */;
  %10 = add(%5, -0.088f /* ty=float32 */) /* ty=Tensor[(15, 1, 224, 224), float32] */;
  %11 = add(%8, -0.188f /* ty=float32 */) /* ty=Tensor[(15, 1, 224, 224), float32] */;
  %12 = (%9, %10, %11);
  %13 = concatenate(%12, axis=1) /* ty=Tensor[(15, 3, 224, 224), float32] */;
  %14 = nn.conv2d(%13, %onnx::Conv_567, strides=[2, 2], padding=[3, 3, 3, 3], channels=64, kernel_size=[7, 7]) /* ty=Tensor[(15, 64, 112, 112), float32] */;
  %15 = nn.bias_add(%14, %onnx::Conv_568) /* ty=Tensor[(15, 64, 112, 112), float32] */;
  %16 = nn.relu(%15) /* ty=Tensor[(15, 64, 112, 112), float32] */;
  %17 = nn.max_pool2d(%16, pool_size=[3, 3], strides=[2, 2], padding=[0, 0, 0, 0], ceil_mode=True) /* ty=Tensor[(15, 64, 56, 56), float32] */;
  %18 = nn.conv2d(%17, %onnx::Conv_570, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(15, 64, 56, 56), float32] */;
  %19 = nn.bias_add(%18, %onnx::Conv_571) /* ty=Tensor[(15, 64, 56, 56), float32] */;
  %20 = nn.relu(%19) /* ty=Tensor[(15, 64, 56, 56), float32] */;
  %21 = nn.conv2d(%20, %onnx::Conv_573, padding=[1, 1, 1, 1], channels=192, kernel_size=[3, 3]) /* ty=Tensor[(15, 192, 56, 56), float32] */;
  %22 = nn.bias_add(%21, %onnx::Conv_574) /* ty=Tensor[(15, 192, 56, 56), float32] */;
  %23 = nn.relu(%22) /* ty=Tensor[(15, 192, 56, 56), float32] */;
  %24 = nn.max_pool2d(%23, pool_size=[3, 3], strides=[2, 2], padding=[0, 0, 0, 0], ceil_mode=True) /* ty=Tensor[(15, 192, 28, 28), float32] */;
  %25 = nn.conv2d(%24, %onnx::Conv_576, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(15, 64, 28, 28), float32] */;
  %26 = nn.bias_add(%25, %onnx::Conv_577) /* ty=Tensor[(15, 64, 28, 28), float32] */;
  %27 = nn.conv2d(%24, %onnx::Conv_579, padding=[0, 0, 0, 0], channels=96, kernel_size=[1, 1]) /* ty=Tensor[(15, 96, 28, 28), float32] */;
  %28 = nn.bias_add(%27, %onnx::Conv_580) /* ty=Tensor[(15, 96, 28, 28), float32] */;
  %29 = nn.relu(%28) /* ty=Tensor[(15, 96, 28, 28), float32] */;
  %30 = nn.conv2d(%29, %onnx::Conv_582, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(15, 128, 28, 28), float32] */;
  %31 = nn.bias_add(%30, %onnx::Conv_583) /* ty=Tensor[(15, 128, 28, 28), float32] */;
  %32 = nn.conv2d(%24, %onnx::Conv_585, padding=[0, 0, 0, 0], channels=16, kernel_size=[1, 1]) /* ty=Tensor[(15, 16, 28, 28), float32] */;
  %33 = nn.bias_add(%32, %onnx::Conv_586) /* ty=Tensor[(15, 16, 28, 28), float32] */;
  %34 = nn.relu(%33) /* ty=Tensor[(15, 16, 28, 28), float32] */;
  %35 = nn.conv2d(%34, %onnx::Conv_588, padding=[1, 1, 1, 1], channels=32, kernel_size=[3, 3]) /* ty=Tensor[(15, 32, 28, 28), float32] */;
  %36 = nn.bias_add(%35, %onnx::Conv_589) /* ty=Tensor[(15, 32, 28, 28), float32] */;
  %37 = nn.max_pool2d(%24, pool_size=[3, 3], padding=[1, 1, 1, 1], ceil_mode=True) /* ty=Tensor[(15, 192, 28, 28), float32] */;
  %38 = nn.conv2d(%37, %onnx::Conv_591, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(15, 32, 28, 28), float32] */;
  %39 = nn.bias_add(%38, %onnx::Conv_592) /* ty=Tensor[(15, 32, 28, 28), float32] */;
  %40 = nn.relu(%26) /* ty=Tensor[(15, 64, 28, 28), float32] */;
  %41 = nn.relu(%31) /* ty=Tensor[(15, 128, 28, 28), float32] */;
  %42 = nn.relu(%36) /* ty=Tensor[(15, 32, 28, 28), float32] */;
  %43 = nn.relu(%39) /* ty=Tensor[(15, 32, 28, 28), float32] */;
  %44 = (%40, %41, %42, %43);
  %45 = concatenate(%44, axis=1) /* ty=Tensor[(15, 256, 28, 28), float32] */;
  %46 = nn.conv2d(%45, %onnx::Conv_594, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(15, 128, 28, 28), float32] */;
  %47 = nn.bias_add(%46, %onnx::Conv_595) /* ty=Tensor[(15, 128, 28, 28), float32] */;
  %48 = nn.conv2d(%45, %onnx::Conv_597, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(15, 128, 28, 28), float32] */;
  %49 = nn.bias_add(%48, %onnx::Conv_598) /* ty=Tensor[(15, 128, 28, 28), float32] */;
  %50 = nn.relu(%49) /* ty=Tensor[(15, 128, 28, 28), float32] */;
  %51 = nn.conv2d(%50, %onnx::Conv_600, padding=[1, 1, 1, 1], channels=192, kernel_size=[3, 3]) /* ty=Tensor[(15, 192, 28, 28), float32] */;
  %52 = nn.bias_add(%51, %onnx::Conv_601) /* ty=Tensor[(15, 192, 28, 28), float32] */;
  %53 = nn.conv2d(%45, %onnx::Conv_603, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(15, 32, 28, 28), float32] */;
  %54 = nn.bias_add(%53, %onnx::Conv_604) /* ty=Tensor[(15, 32, 28, 28), float32] */;
  %55 = nn.relu(%54) /* ty=Tensor[(15, 32, 28, 28), float32] */;
  %56 = nn.conv2d(%55, %onnx::Conv_606, padding=[1, 1, 1, 1], channels=96, kernel_size=[3, 3]) /* ty=Tensor[(15, 96, 28, 28), float32] */;
  %57 = nn.bias_add(%56, %onnx::Conv_607) /* ty=Tensor[(15, 96, 28, 28), float32] */;
  %58 = nn.max_pool2d(%45, pool_size=[3, 3], padding=[1, 1, 1, 1], ceil_mode=True) /* ty=Tensor[(15, 256, 28, 28), float32] */;
  %59 = nn.conv2d(%58, %onnx::Conv_609, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(15, 64, 28, 28), float32] */;
  %60 = nn.bias_add(%59, %onnx::Conv_610) /* ty=Tensor[(15, 64, 28, 28), float32] */;
  %61 = nn.relu(%47) /* ty=Tensor[(15, 128, 28, 28), float32] */;
  %62 = nn.relu(%52) /* ty=Tensor[(15, 192, 28, 28), float32] */;
  %63 = nn.relu(%57) /* ty=Tensor[(15, 96, 28, 28), float32] */;
  %64 = nn.relu(%60) /* ty=Tensor[(15, 64, 28, 28), float32] */;
  %65 = (%61, %62, %63, %64);
  %66 = concatenate(%65, axis=1) /* ty=Tensor[(15, 480, 28, 28), float32] */;
  %67 = nn.max_pool2d(%66, pool_size=[3, 3], strides=[2, 2], padding=[0, 0, 0, 0], ceil_mode=True) /* ty=Tensor[(15, 480, 14, 14), float32] */;
  %68 = nn.conv2d(%67, %onnx::Conv_612, padding=[0, 0, 0, 0], channels=192, kernel_size=[1, 1]) /* ty=Tensor[(15, 192, 14, 14), float32] */;
  %69 = nn.bias_add(%68, %onnx::Conv_613) /* ty=Tensor[(15, 192, 14, 14), float32] */;
  %70 = nn.conv2d(%67, %onnx::Conv_615, padding=[0, 0, 0, 0], channels=96, kernel_size=[1, 1]) /* ty=Tensor[(15, 96, 14, 14), float32] */;
  %71 = nn.bias_add(%70, %onnx::Conv_616) /* ty=Tensor[(15, 96, 14, 14), float32] */;
  %72 = nn.relu(%71) /* ty=Tensor[(15, 96, 14, 14), float32] */;
  %73 = nn.conv2d(%72, %onnx::Conv_618, padding=[1, 1, 1, 1], channels=208, kernel_size=[3, 3]) /* ty=Tensor[(15, 208, 14, 14), float32] */;
  %74 = nn.bias_add(%73, %onnx::Conv_619) /* ty=Tensor[(15, 208, 14, 14), float32] */;
  %75 = nn.conv2d(%67, %onnx::Conv_621, padding=[0, 0, 0, 0], channels=16, kernel_size=[1, 1]) /* ty=Tensor[(15, 16, 14, 14), float32] */;
  %76 = nn.bias_add(%75, %onnx::Conv_622) /* ty=Tensor[(15, 16, 14, 14), float32] */;
  %77 = nn.relu(%76) /* ty=Tensor[(15, 16, 14, 14), float32] */;
  %78 = nn.conv2d(%77, %onnx::Conv_624, padding=[1, 1, 1, 1], channels=48, kernel_size=[3, 3]) /* ty=Tensor[(15, 48, 14, 14), float32] */;
  %79 = nn.bias_add(%78, %onnx::Conv_625) /* ty=Tensor[(15, 48, 14, 14), float32] */;
  %80 = nn.max_pool2d(%67, pool_size=[3, 3], padding=[1, 1, 1, 1], ceil_mode=True) /* ty=Tensor[(15, 480, 14, 14), float32] */;
  %81 = nn.conv2d(%80, %onnx::Conv_627, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %82 = nn.bias_add(%81, %onnx::Conv_628) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %83 = nn.relu(%69) /* ty=Tensor[(15, 192, 14, 14), float32] */;
  %84 = nn.relu(%74) /* ty=Tensor[(15, 208, 14, 14), float32] */;
  %85 = nn.relu(%79) /* ty=Tensor[(15, 48, 14, 14), float32] */;
  %86 = nn.relu(%82) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %87 = (%83, %84, %85, %86);
  %88 = concatenate(%87, axis=1) /* ty=Tensor[(15, 512, 14, 14), float32] */;
  %89 = nn.conv2d(%88, %onnx::Conv_630, padding=[0, 0, 0, 0], channels=160, kernel_size=[1, 1]) /* ty=Tensor[(15, 160, 14, 14), float32] */;
  %90 = nn.bias_add(%89, %onnx::Conv_631) /* ty=Tensor[(15, 160, 14, 14), float32] */;
  %91 = nn.conv2d(%88, %onnx::Conv_633, padding=[0, 0, 0, 0], channels=112, kernel_size=[1, 1]) /* ty=Tensor[(15, 112, 14, 14), float32] */;
  %92 = nn.bias_add(%91, %onnx::Conv_634) /* ty=Tensor[(15, 112, 14, 14), float32] */;
  %93 = nn.relu(%92) /* ty=Tensor[(15, 112, 14, 14), float32] */;
  %94 = nn.conv2d(%93, %onnx::Conv_636, padding=[1, 1, 1, 1], channels=224, kernel_size=[3, 3]) /* ty=Tensor[(15, 224, 14, 14), float32] */;
  %95 = nn.bias_add(%94, %onnx::Conv_637) /* ty=Tensor[(15, 224, 14, 14), float32] */;
  %96 = nn.conv2d(%88, %onnx::Conv_639, padding=[0, 0, 0, 0], channels=24, kernel_size=[1, 1]) /* ty=Tensor[(15, 24, 14, 14), float32] */;
  %97 = nn.bias_add(%96, %onnx::Conv_640) /* ty=Tensor[(15, 24, 14, 14), float32] */;
  %98 = nn.relu(%97) /* ty=Tensor[(15, 24, 14, 14), float32] */;
  %99 = nn.conv2d(%98, %onnx::Conv_642, padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %100 = nn.bias_add(%99, %onnx::Conv_643) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %101 = nn.max_pool2d(%88, pool_size=[3, 3], padding=[1, 1, 1, 1], ceil_mode=True) /* ty=Tensor[(15, 512, 14, 14), float32] */;
  %102 = nn.conv2d(%101, %onnx::Conv_645, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %103 = nn.bias_add(%102, %onnx::Conv_646) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %104 = nn.relu(%90) /* ty=Tensor[(15, 160, 14, 14), float32] */;
  %105 = nn.relu(%95) /* ty=Tensor[(15, 224, 14, 14), float32] */;
  %106 = nn.relu(%100) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %107 = nn.relu(%103) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %108 = (%104, %105, %106, %107);
  %109 = concatenate(%108, axis=1) /* ty=Tensor[(15, 512, 14, 14), float32] */;
  %110 = nn.conv2d(%109, %onnx::Conv_648, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(15, 128, 14, 14), float32] */;
  %111 = nn.bias_add(%110, %onnx::Conv_649) /* ty=Tensor[(15, 128, 14, 14), float32] */;
  %112 = nn.conv2d(%109, %onnx::Conv_651, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(15, 128, 14, 14), float32] */;
  %113 = nn.bias_add(%112, %onnx::Conv_652) /* ty=Tensor[(15, 128, 14, 14), float32] */;
  %114 = nn.relu(%113) /* ty=Tensor[(15, 128, 14, 14), float32] */;
  %115 = nn.conv2d(%114, %onnx::Conv_654, padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]) /* ty=Tensor[(15, 256, 14, 14), float32] */;
  %116 = nn.bias_add(%115, %onnx::Conv_655) /* ty=Tensor[(15, 256, 14, 14), float32] */;
  %117 = nn.conv2d(%109, %onnx::Conv_657, padding=[0, 0, 0, 0], channels=24, kernel_size=[1, 1]) /* ty=Tensor[(15, 24, 14, 14), float32] */;
  %118 = nn.bias_add(%117, %onnx::Conv_658) /* ty=Tensor[(15, 24, 14, 14), float32] */;
  %119 = nn.relu(%118) /* ty=Tensor[(15, 24, 14, 14), float32] */;
  %120 = nn.conv2d(%119, %onnx::Conv_660, padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %121 = nn.bias_add(%120, %onnx::Conv_661) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %122 = nn.max_pool2d(%109, pool_size=[3, 3], padding=[1, 1, 1, 1], ceil_mode=True) /* ty=Tensor[(15, 512, 14, 14), float32] */;
  %123 = nn.conv2d(%122, %onnx::Conv_663, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %124 = nn.bias_add(%123, %onnx::Conv_664) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %125 = nn.relu(%111) /* ty=Tensor[(15, 128, 14, 14), float32] */;
  %126 = nn.relu(%116) /* ty=Tensor[(15, 256, 14, 14), float32] */;
  %127 = nn.relu(%121) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %128 = nn.relu(%124) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %129 = (%125, %126, %127, %128);
  %130 = concatenate(%129, axis=1) /* ty=Tensor[(15, 512, 14, 14), float32] */;
  %131 = nn.conv2d(%130, %onnx::Conv_666, padding=[0, 0, 0, 0], channels=112, kernel_size=[1, 1]) /* ty=Tensor[(15, 112, 14, 14), float32] */;
  %132 = nn.bias_add(%131, %onnx::Conv_667) /* ty=Tensor[(15, 112, 14, 14), float32] */;
  %133 = nn.conv2d(%130, %onnx::Conv_669, padding=[0, 0, 0, 0], channels=144, kernel_size=[1, 1]) /* ty=Tensor[(15, 144, 14, 14), float32] */;
  %134 = nn.bias_add(%133, %onnx::Conv_670) /* ty=Tensor[(15, 144, 14, 14), float32] */;
  %135 = nn.relu(%134) /* ty=Tensor[(15, 144, 14, 14), float32] */;
  %136 = nn.conv2d(%135, %onnx::Conv_672, padding=[1, 1, 1, 1], channels=288, kernel_size=[3, 3]) /* ty=Tensor[(15, 288, 14, 14), float32] */;
  %137 = nn.bias_add(%136, %onnx::Conv_673) /* ty=Tensor[(15, 288, 14, 14), float32] */;
  %138 = nn.conv2d(%130, %onnx::Conv_675, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(15, 32, 14, 14), float32] */;
  %139 = nn.bias_add(%138, %onnx::Conv_676) /* ty=Tensor[(15, 32, 14, 14), float32] */;
  %140 = nn.relu(%139) /* ty=Tensor[(15, 32, 14, 14), float32] */;
  %141 = nn.conv2d(%140, %onnx::Conv_678, padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %142 = nn.bias_add(%141, %onnx::Conv_679) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %143 = nn.max_pool2d(%130, pool_size=[3, 3], padding=[1, 1, 1, 1], ceil_mode=True) /* ty=Tensor[(15, 512, 14, 14), float32] */;
  %144 = nn.conv2d(%143, %onnx::Conv_681, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %145 = nn.bias_add(%144, %onnx::Conv_682) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %146 = nn.relu(%132) /* ty=Tensor[(15, 112, 14, 14), float32] */;
  %147 = nn.relu(%137) /* ty=Tensor[(15, 288, 14, 14), float32] */;
  %148 = nn.relu(%142) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %149 = nn.relu(%145) /* ty=Tensor[(15, 64, 14, 14), float32] */;
  %150 = (%146, %147, %148, %149);
  %151 = concatenate(%150, axis=1) /* ty=Tensor[(15, 528, 14, 14), float32] */;
  %152 = nn.conv2d(%151, %onnx::Conv_684, padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]) /* ty=Tensor[(15, 256, 14, 14), float32] */;
  %153 = nn.bias_add(%152, %onnx::Conv_685) /* ty=Tensor[(15, 256, 14, 14), float32] */;
  %154 = nn.conv2d(%151, %onnx::Conv_687, padding=[0, 0, 0, 0], channels=160, kernel_size=[1, 1]) /* ty=Tensor[(15, 160, 14, 14), float32] */;
  %155 = nn.bias_add(%154, %onnx::Conv_688) /* ty=Tensor[(15, 160, 14, 14), float32] */;
  %156 = nn.relu(%155) /* ty=Tensor[(15, 160, 14, 14), float32] */;
  %157 = nn.conv2d(%156, %onnx::Conv_690, padding=[1, 1, 1, 1], channels=320, kernel_size=[3, 3]) /* ty=Tensor[(15, 320, 14, 14), float32] */;
  %158 = nn.bias_add(%157, %onnx::Conv_691) /* ty=Tensor[(15, 320, 14, 14), float32] */;
  %159 = nn.conv2d(%151, %onnx::Conv_693, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(15, 32, 14, 14), float32] */;
  %160 = nn.bias_add(%159, %onnx::Conv_694) /* ty=Tensor[(15, 32, 14, 14), float32] */;
  %161 = nn.relu(%160) /* ty=Tensor[(15, 32, 14, 14), float32] */;
  %162 = nn.conv2d(%161, %onnx::Conv_696, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(15, 128, 14, 14), float32] */;
  %163 = nn.bias_add(%162, %onnx::Conv_697) /* ty=Tensor[(15, 128, 14, 14), float32] */;
  %164 = nn.max_pool2d(%151, pool_size=[3, 3], padding=[1, 1, 1, 1], ceil_mode=True) /* ty=Tensor[(15, 528, 14, 14), float32] */;
  %165 = nn.conv2d(%164, %onnx::Conv_699, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(15, 128, 14, 14), float32] */;
  %166 = nn.bias_add(%165, %onnx::Conv_700) /* ty=Tensor[(15, 128, 14, 14), float32] */;
  %167 = nn.relu(%153) /* ty=Tensor[(15, 256, 14, 14), float32] */;
  %168 = nn.relu(%158) /* ty=Tensor[(15, 320, 14, 14), float32] */;
  %169 = nn.relu(%163) /* ty=Tensor[(15, 128, 14, 14), float32] */;
  %170 = nn.relu(%166) /* ty=Tensor[(15, 128, 14, 14), float32] */;
  %171 = (%167, %168, %169, %170);
  %172 = concatenate(%171, axis=1) /* ty=Tensor[(15, 832, 14, 14), float32] */;
  %173 = nn.max_pool2d(%172, pool_size=[2, 2], strides=[2, 2], padding=[0, 0, 0, 0], ceil_mode=True) /* ty=Tensor[(15, 832, 7, 7), float32] */;
  %174 = nn.conv2d(%173, %onnx::Conv_702, padding=[0, 0, 0, 0], channels=256, kernel_size=[1, 1]) /* ty=Tensor[(15, 256, 7, 7), float32] */;
  %175 = nn.bias_add(%174, %onnx::Conv_703) /* ty=Tensor[(15, 256, 7, 7), float32] */;
  %176 = nn.conv2d(%173, %onnx::Conv_705, padding=[0, 0, 0, 0], channels=160, kernel_size=[1, 1]) /* ty=Tensor[(15, 160, 7, 7), float32] */;
  %177 = nn.bias_add(%176, %onnx::Conv_706) /* ty=Tensor[(15, 160, 7, 7), float32] */;
  %178 = nn.relu(%177) /* ty=Tensor[(15, 160, 7, 7), float32] */;
  %179 = nn.conv2d(%178, %onnx::Conv_708, padding=[1, 1, 1, 1], channels=320, kernel_size=[3, 3]) /* ty=Tensor[(15, 320, 7, 7), float32] */;
  %180 = nn.bias_add(%179, %onnx::Conv_709) /* ty=Tensor[(15, 320, 7, 7), float32] */;
  %181 = nn.conv2d(%173, %onnx::Conv_711, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(15, 32, 7, 7), float32] */;
  %182 = nn.bias_add(%181, %onnx::Conv_712) /* ty=Tensor[(15, 32, 7, 7), float32] */;
  %183 = nn.relu(%182) /* ty=Tensor[(15, 32, 7, 7), float32] */;
  %184 = nn.conv2d(%183, %onnx::Conv_714, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(15, 128, 7, 7), float32] */;
  %185 = nn.bias_add(%184, %onnx::Conv_715) /* ty=Tensor[(15, 128, 7, 7), float32] */;
  %186 = nn.max_pool2d(%173, pool_size=[3, 3], padding=[1, 1, 1, 1], ceil_mode=True) /* ty=Tensor[(15, 832, 7, 7), float32] */;
  %187 = nn.conv2d(%186, %onnx::Conv_717, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(15, 128, 7, 7), float32] */;
  %188 = nn.bias_add(%187, %onnx::Conv_718) /* ty=Tensor[(15, 128, 7, 7), float32] */;
  %189 = nn.relu(%175) /* ty=Tensor[(15, 256, 7, 7), float32] */;
  %190 = nn.relu(%180) /* ty=Tensor[(15, 320, 7, 7), float32] */;
  %191 = nn.relu(%185) /* ty=Tensor[(15, 128, 7, 7), float32] */;
  %192 = nn.relu(%188) /* ty=Tensor[(15, 128, 7, 7), float32] */;
  %193 = (%189, %190, %191, %192);
  %194 = concatenate(%193, axis=1) /* ty=Tensor[(15, 832, 7, 7), float32] */;
  %195 = nn.conv2d(%194, %onnx::Conv_720, padding=[0, 0, 0, 0], channels=384, kernel_size=[1, 1]) /* ty=Tensor[(15, 384, 7, 7), float32] */;
  %196 = nn.bias_add(%195, %onnx::Conv_721) /* ty=Tensor[(15, 384, 7, 7), float32] */;
  %197 = nn.conv2d(%194, %onnx::Conv_723, padding=[0, 0, 0, 0], channels=192, kernel_size=[1, 1]) /* ty=Tensor[(15, 192, 7, 7), float32] */;
  %198 = nn.bias_add(%197, %onnx::Conv_724) /* ty=Tensor[(15, 192, 7, 7), float32] */;
  %199 = nn.relu(%198) /* ty=Tensor[(15, 192, 7, 7), float32] */;
  %200 = nn.conv2d(%199, %onnx::Conv_726, padding=[1, 1, 1, 1], channels=384, kernel_size=[3, 3]) /* ty=Tensor[(15, 384, 7, 7), float32] */;
  %201 = nn.bias_add(%200, %onnx::Conv_727) /* ty=Tensor[(15, 384, 7, 7), float32] */;
  %202 = nn.conv2d(%194, %onnx::Conv_729, padding=[0, 0, 0, 0], channels=48, kernel_size=[1, 1]) /* ty=Tensor[(15, 48, 7, 7), float32] */;
  %203 = nn.bias_add(%202, %onnx::Conv_730) /* ty=Tensor[(15, 48, 7, 7), float32] */;
  %204 = nn.relu(%203) /* ty=Tensor[(15, 48, 7, 7), float32] */;
  %205 = nn.conv2d(%204, %onnx::Conv_732, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(15, 128, 7, 7), float32] */;
  %206 = nn.bias_add(%205, %onnx::Conv_733) /* ty=Tensor[(15, 128, 7, 7), float32] */;
  %207 = nn.max_pool2d(%194, pool_size=[3, 3], padding=[1, 1, 1, 1], ceil_mode=True) /* ty=Tensor[(15, 832, 7, 7), float32] */;
  %208 = nn.conv2d(%207, %onnx::Conv_735, padding=[0, 0, 0, 0], channels=128, kernel_size=[1, 1]) /* ty=Tensor[(15, 128, 7, 7), float32] */;
  %209 = nn.bias_add(%208, %onnx::Conv_736) /* ty=Tensor[(15, 128, 7, 7), float32] */;
  %210 = nn.relu(%196) /* ty=Tensor[(15, 384, 7, 7), float32] */;
  %211 = nn.relu(%201) /* ty=Tensor[(15, 384, 7, 7), float32] */;
  %212 = nn.relu(%206) /* ty=Tensor[(15, 128, 7, 7), float32] */;
  %213 = nn.relu(%209) /* ty=Tensor[(15, 128, 7, 7), float32] */;
  %214 = (%210, %211, %212, %213);
  %215 = concatenate(%214, axis=1) /* ty=Tensor[(15, 1024, 7, 7), float32] */;
  %216 = nn.global_avg_pool2d(%215) /* ty=Tensor[(15, 1024, 1, 1), float32] */;
  %217 = nn.batch_flatten(%216) /* ty=Tensor[(15, 1024), float32] */;
  %218 = nn.batch_flatten(%217) /* ty=Tensor[(15, 1024), float32] */;
  %219 = nn.dense(%218, %fc.weight, units=1000) /* ty=Tensor[(15, 1000), float32] */;
  %220 = multiply(1f /* ty=float32 */, %fc.bias) /* ty=Tensor[(1000), float32] */;
  add(%219, %220) /* ty=Tensor[(15, 1000), float32] */
}