def @main(%features.5.weight: Tensor[(128, 64, 3, 3), float32], %call_6: Tensor[(15, 64, 112, 112), float32] {
  nn.conv2d(%6, %features.5.weight, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(15, 128, 112, 112), float32] */;
}