def @main(%vgg0_conv3_weight: Tensor[(128, 128, 3, 3), float32], %call_9: Tensor[(1, 128, 112, 112), float32] {
  nn.conv2d(%9, %vgg0_conv3_weight, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(1, 128, 112, 112), float32] */;
}