def @main(%vgg0_conv14_weight: Tensor[(512, 512, 3, 3), float32], %call_45: Tensor[(1, 512, 14, 14), float32] {
  nn.conv2d(%45, %vgg0_conv14_weight, padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]) /* ty=Tensor[(1, 512, 14, 14), float32] */;
}