def @main(%call_39: Tensor[(15, 512, 14, 14), float32], %features.28.weight: Tensor[(512, 512, 3, 3), float32] {
  nn.conv2d(%39, %features.28.weight, padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]) /* ty=Tensor[(15, 512, 14, 14), float32] */;
}