def @main(%vgg0_conv8_weight: Tensor[(512, 256, 3, 3), float32], %call_26: Tensor[(1, 256, 28, 28), float32] {
  nn.conv2d(%26, %vgg0_conv8_weight, padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]) /* ty=Tensor[(1, 512, 28, 28), float32] */;
}