def @main(%call_13: Tensor[(1, 128, 56, 56), float32], %vgg0_conv4_weight: Tensor[(256, 128, 3, 3), float32] {
  nn.conv2d(%13, %vgg0_conv4_weight, padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]) /* ty=Tensor[(1, 256, 56, 56), float32] */;
}