def @main(%features.10.weight: Tensor[(256, 128, 3, 3), float32], %call_13: Tensor[(15, 128, 56, 56), float32] {
  nn.conv2d(%13, %features.10.weight, padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]) /* ty=Tensor[(15, 256, 56, 56), float32] */;
}