def @main(%call_9: Tensor[(15, 128, 112, 112), float32], %features.7.weight: Tensor[(128, 128, 3, 3), float32] {
  nn.conv2d(%9, %features.7.weight, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(15, 128, 112, 112), float32] */;
}