def @main(%vgg0_conv15_weight: Tensor[(512, 512, 3, 3), float32], %call_48: Tensor[(1, 512, 14, 14), float32] {
  nn.conv2d(%48, %vgg0_conv15_weight, padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]) /* ty=Tensor[(1, 512, 14, 14), float32] */;
}