def @main(%vgg0_conv12_weight: Tensor[(512, 512, 3, 3), float32], %call_39: Tensor[(1, 512, 14, 14), float32] {
  nn.conv2d(%39, %vgg0_conv12_weight, padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]) /* ty=Tensor[(1, 512, 14, 14), float32] */;
}