def @main(%features.14.weight: Tensor[(256, 256, 3, 3), float32], %call_19: Tensor[(15, 256, 56, 56), float32] {
  nn.conv2d(%19, %features.14.weight, padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]) /* ty=Tensor[(15, 256, 56, 56), float32] */;
}