def @main(%vgg0_conv2_weight: Tensor[(128, 64, 3, 3), float32], %call_6: Tensor[(1, 64, 112, 112), float32] {
  nn.conv2d(%6, %vgg0_conv2_weight, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(1, 128, 112, 112), float32] */;
}