def @main(%features.23.weight: Tensor[(512, 512, 3, 3), float32], %call_32: Tensor[(15, 512, 28, 28), float32] {
  nn.conv2d(%32, %features.23.weight, padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]) /* ty=Tensor[(15, 512, 28, 28), float32] */;
}