def @main(%features.16.weight: Tensor[(256, 256, 3, 3), float32], %call_22: Tensor[(15, 256, 56, 56), float32] {
  nn.conv2d(%22, %features.16.weight, padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]) /* ty=Tensor[(15, 256, 56, 56), float32] */;
}