def @main(%call_35: Tensor[(1, 512, 28, 28), float32], %vgg0_conv11_weight: Tensor[(512, 512, 3, 3), float32] {
  nn.conv2d(%35, %vgg0_conv11_weight, padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]) /* ty=Tensor[(1, 512, 28, 28), float32] */;
}