def @main(%call_2: Tensor[(1, 64, 224, 224), float32], %vgg0_conv1_weight: Tensor[(64, 64, 3, 3), float32] {
  nn.conv2d(%2, %vgg0_conv1_weight, padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(1, 64, 224, 224), float32] */;
}