def @main(%call_26: Tensor[(15, 256, 28, 28), float32], %features.19.weight: Tensor[(512, 256, 3, 3), float32] {
  nn.conv2d(%26, %features.19.weight, padding=[1, 1, 1, 1], channels=512, kernel_size=[3, 3]) /* ty=Tensor[(15, 512, 28, 28), float32] */;
}