def @main(%vgg0_conv0_bias: Tensor[(64), float32], %vgg0_conv0_weight: Tensor[(64, 3, 3, 3), float32], %data: Tensor[(1, 3, 224, 224), float32] {
  %0 = nn.conv2d(%data, %vgg0_conv0_weight, padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(1, 64, 224, 224), float32] */;
  nn.bias_add(%0, %vgg0_conv0_bias) /* ty=Tensor[(1, 64, 224, 224), float32] */;
}