def @main(%features.12.weight: Tensor[(256, 256, 3, 3), float32], %call_16: Tensor[(15, 256, 56, 56), float32] {
  nn.conv2d(%16, %features.12.weight, padding=[1, 1, 1, 1], channels=256, kernel_size=[3, 3]) /* ty=Tensor[(15, 256, 56, 56), float32] */;
}