def @main(%data: Tensor[(15, 3, 224, 224), float32], %features.0.weight: Tensor[(64, 3, 3, 3), float32] {
  nn.conv2d(%data, %features.0.weight, padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(15, 64, 224, 224), float32] */;
}